Repository: Nitrokey/nitrokey-doc
Catalog: locales/*/LC_MESSAGES/nextbox.po
Languages: da

source: **There is absolutely no need for a fan, the NextBox is designed to work without an active cooling**. Although if the NextBox is used for additional tasks (it's still a Linux), we have prepared a fan mount for a 30mm x 12mm fan at 5V connected to the shield. More details (connector, used pins) can be taken from `NextBox' GitHub`_. Currently we *do not* recommend adding a fan as the outputs are not controlled yet by the NextBox daemon, so this is also something you would have to do by yourself.
da: **Der er absolut intet behov for en ventilator, NextBox er designet til at fungere uden aktiv køling**. Selvom hvis NextBoxen bruges til yderligere opgaver (det er stadig en Linux), har vi forberedt en fan mount til en 30mm x 12mm fan ved 5V tilsluttet til skjoldet. Flere detaljer (stik, anvendte pins) kan tages fra `NextBox' GitHub`_. I øjeblikket *anbefaler* vi ikke at tilføje en ventilator, da udgangene endnu ikke styres af NextBox-dæmonen, så det er også noget du selv skal gøre.

source: **Q:**: Can I upgrade the NextBox' RAM size?
da: **Q:**: Kan jeg opgradere NextBox' RAM størrelsen?

source: No, the Raspberry PI 4B has the RAM component soldered onto the mainboard, thus it cannot be replaced/extended.
da: Nej, på Raspberry PI 4B er RAM-komponenten loddet fast på hovedkortet, og den kan derfor ikke udskiftes/udvides.

source: NextBox FAQ
da: Ofte stillede spørgsmål om NextBox

source: Nextcloud FAQ
da: Ofte stillede spørgsmål om Nextcloud

source: **Q:** Why does Nitrokey currently not recommend to use OnlyOffice or Collabora Office on the NextBox?
da: **Q:** Hvorfor anbefaler Nitrokey i øjeblikket ikke at bruge OnlyOffice eller Collabora Office på NextBox?

source: The state of these Nextcloud apps is not yet mature (for ARM platforms). Although it is (partly) possible to install them we do not recommend doing so currently.
da: Disse Nextcloud-apps er endnu ikke modne (for ARM-platforme). Selv om det (delvist) er muligt at installere dem, anbefaler vi ikke at gøre det i øjeblikket.

source: **Q:** Why does updating Nextcloud from inside Nextcloud not work?
da: **Q:** Hvorfor virker opdatering af Nextcloud inde fra Nextcloud ikke?

source: The Nextcloud version is rolled out by us. Thus the option to update from inside Nextcloud is not working.
da: Nextcloud-versionen udrulles af os. Derfor fungerer muligheden for at opdatere fra Nextcloud ikke.

source: **Q:** Can I add apps to the Nextcloud instance?
da: **Q:** Kan jeg tilføje apps til Nextcloud-instansen?

source: Yes, the Nextcloud app store is available and any app available there can be installed through the Nextcloud web frontend.
da: Ja, Nextcloud App Store er tilgængelig, og alle apps, der er tilgængelige der, kan installeres via Nextclouds webfrontend.

source: **Q:** My Nextcloud instance is stuck in "Maintenance Mode", how can I switch it off?
da: **Q:** Min Nextcloud-instans er fastlåst i "Maintenance Mode", hvordan kan jeg slukke den?

source: To *force exit* the Nextcloud "Maintenance Mode", you can push the hardware button **shortly, once**. The NextBox will then switch-off the maintenance mode. Please avoid this, if possible.
da: For at *forcere* Nextcloud "Vedligeholdelsestilstand" kan du trykke på hardwareknappen **kortvarigt, én gang**. NextBoxen vil derefter slukke for vedligeholdelsestilstanden. Undgå venligst dette, hvis det er muligt.

source: **Q:** Why am I getting a permission warning for ``/var/www/html/custom_apps/nextbox`` inside the Nextcloud settings overview?
da: **Q:** Hvorfor får jeg en advarsel om tilladelse til ``/var/www/html/custom_apps/nextbox`` i oversigten over Nextcloud-indstillinger?

source: This is a "feature". The NextBox Nextcloud App is installed on the system with the Debian nextbox package. To avoid an accidental deletion of the NextBox Nextcloud App from within the Nextcloud app management, the stated directory can not be written by Nextcloud, this is what Nextcloud is complaining about here.
da: Dette er en "funktion". NextBox Nextcloud-appen er installeret på systemet med Debian nextbox-pakken. For at undgå en utilsigtet sletning af NextBox Nextcloud-appen fra Nextcloud-apphåndteringen, kan den angivne mappe ikke skrives af Nextcloud, det er det, som Nextcloud klager over her.

source: **Q:** How can I run Nextcloud's `occ`?
da: **Q:** Hvordan kan jeg køre Nextcloud's `occ`?

source: As Nextcloud is running inside a Docker container, you need to be root and execute the following: ``docker exec -it -u www-data nextbox-compose_app_1 /var/www/html/occ``
da: Da Nextcloud kører i en Docker-container, skal du være root og udføre følgende: ``docker exec -it -u www-data nextbox-compose_app_1 /var/www/html/occ``

source: **Q:** What to do about missing php-modules like `imagemagick`?
da: **Q:** Hvad gør man ved manglende php-moduler som `imagemagick`?

source: Similar to Apache, PHP is also provided by the Nextcloud container, therefore as we are using the stock Nextcloud container this will also only be resolved once this is resolved by the Nextcloud Team.
da: I lighed med Apache leveres PHP også af Nextcloud-containeren, og da vi bruger den standard Nextcloud-container, vil dette også først blive løst, når Nextcloud-teamet har løst dette problem.

source: **Q:** Why is my Nextcloud not loading properly, instead I get a white page and a `.htaccess` error?
da: **Q:** Hvorfor indlæses min Nextcloud ikke korrekt, i stedet får jeg en hvid side og en `.htaccess`-fejl?

source: This usually is an indication that the OS has unmounted/detached the internal hard-drive due to an low-power-incident. Please make sure you read and understood :ref:`USB power<faq-nextbox-hardware-usb-power-supply>`. In most cases doing a power-cycle (unplug the USB-C connector, wait 5secs and plug it in again) should resolve this. **Make sure no additional USB devices are connected during this procedure.**
da: Dette er normalt en indikation af, at operativsystemet har afmonteret/afmonteret den interne harddisk på grund af et uheld med lavt strømforbrug. Sørg for, at du har læst og forstået :ref:`USB power<faq-nextbox-hardware-usb-power-supply>`. I de fleste tilfælde bør en strømcyklus (tag USB-C-stikket ud af stikket, vent 5 sek. og sæt det i igen) løse dette problem. **Sørg for, at der ikke er tilsluttet yderligere USB-enheder under denne procedure.**

source: Remote Access FAQ
da: Ofte stillede spørgsmål om fjernadgang

source: **Q:** What is the correct WebDAV URL?
da: **Q:** Hvad er den korrekte WebDAV-URL?

source: The full URL to use for WebDAV is: ``https://my.domain.tld/remote.php/webdav/``, there have been reports that for native Windows WebDAV you might need: ``https://my.domain.tld/remote.php/dav/files/USERNAME`` with *USERNAME* being the username you would like to use.
da: Den fulde URL, der skal bruges til WebDAV, er: ``https://my.domain.tld/remote.php/webdav/``, der har været rapporteret, at for native Windows WebDAV skal du måske bruge: `: ``https://my.domain.tld/remote.php/dav/files/USERNAME`` med *USERNAME* som det brugernavn, du ønsker at bruge.

source: **Q:** Can I access my Nextcloud instance using WebDAV?
da: **Q:** Kan jeg få adgang til min Nextcloud-instans ved hjælp af WebDAV?

source: Yes, please see `Nextcloud WebDAV documentation`_ for a complete overview. A simple mount for unix-like systems might look like this: ``mount -t davfs https://my.domain.tld/remote.php/webdav/ /mnt/target/path`` while making sure that the ``davfs2`` package is installed. For Windows please additionally read these :doc:`docs <../clients/windows>`.
da: Ja, se `Nextcloud WebDAV-dokumentation`_ for at få en komplet oversigt. En simpel mount til unix-lignende systemer kan se således ud: ``mount -t davfs https://my.domain.tld/remote.php/webdav/ /mnt/target/path``, mens du sørger for, at pakken ``davfs2`` er installeret. For Windows skal du desuden læse disse :doc:`docs <../clients/windows>`.

source: **Q:**: Why does my Android smartphone's browser not open: ``http://nextbox.local``
da: **Q:**: Hvorfor kan min Android smartphone's browser ikke åbnes: ``http://nextbox.local``

source: As of today the technology needed to use ``.local`` URLs is not supported by various (stock) Android browser(s). The mechanism is based on ``mDNS``. One possible workaround is to use a 3rd party app like BonjourBrowser to discover all mDNS services in your network.
da: I dag understøttes den teknologi, der er nødvendig for at bruge ``.local`` URL'er, ikke af forskellige (standard) Android-browsere. Mekanismen er baseret på ``mDNS``. En mulig løsning er at bruge en tredjepartsapp som BonjourBrowser til at finde alle mDNS-tjenester i dit netværk.

source: **Q:**: Why does accessing my NextBox using: ``http://nextbox.local`` not work?
da: **Q:**: Hvorfor får jeg ikke adgang til min NextBox ved hjælp af: ``http://nextbox.local`` ikke virker?

source: There are several other reasons why the access using ``http://nextbox.local`` may not work, further known scenarios are:
da: Der er flere andre grunde til, at adgangen ved hjælp af ``http://nextbox.local`` måske ikke virker, andre kendte scenarier er:

source: Using a Fritz!Box with the NextBox being connected via a LAN port and the client/browser is connected to the network via WiFI (WLAN), the Fritz!Box will block mDNS.
da: Hvis du bruger en Fritz!Box med NextBox tilsluttet via en LAN-port, og klienten/browser er tilsluttet til netværket via WiFI (WLAN), blokerer Fritz!Box mDNS.

source: **Q:**: I followed all guides and still cannot acquire the TLS certificate, what can I do?
da: **Q:**: Jeg har fulgt alle vejledninger, men kan stadig ikke få TLS-certifikatet, hvad kan jeg gøre?

source: The reason a TLS certificate cannot be acquired is nearly always the fact that your NextBox is not reachable from the internet. Make sure you have followed the :doc:`../remote/walkthrough`. If you followed the step-by-step instructions and it still does not work, very likely something is blocking the connection, typical candidates are router web administration features like: ``MyFritz!``, ``Fritz Web Services`` or similar services, which are running on your router and thus blocking the traffic on port(s) 80 and/or 443. Switch them off and retry acquiring your TLS certificate.
da: Grunden til at et TLS-certifikat ikke kan erhverves er næsten altid, at din NextBox ikke kan nås fra internettet. Sørg for, at du har fulgt :doc:`../remote/walkthrough`. Hvis du har fulgt trin-for-trin vejledningen og det stadig ikke virker, er der højst sandsynligt noget der blokerer forbindelsen, typiske kandidater er router webadministrationsfunktioner som f.eks: ``MyFritz!``, ``Fritz Web Services`` eller lignende tjenester, som kører på din router og dermed blokerer for trafikken på port(e) 80 og/eller 443. Slå dem fra, og prøv atter at erhverve dit TLS-certifikat.

source: **Q:** Why is my reachability with IPv4 not working?
da: **Q:** Hvorfor virker min rækkevidde med IPv4 ikke?

source: If you have properly set up :doc:`port forwarding <../remote/port-forwarding>` and IPv4 connections (reachability test) are still not working there are good chances that your Internet-Service-Provider (ISP) does not provide a proper (public) IPv4 address to you. There are several (end-customer) internet technologies, which do not allow incoming traffic for the IPv4, which was assigned to you. An incomplete list is: *private IPv4 address*, *DS-Lite connection* or *CarrierGrade-NAT (CG-NAT)*. All these essentially share one IPv4 address accross multiple users, thus block (incoming) traffic from the internet to you. Some ISPs allow upgrading to so-called **full-stack connections**, which should enable full bi-directional traffic for IPv4 and IPv6.
da: Hvis du har konfigureret :doc:`port forwarding <../remote/port-forwarding>` korrekt, og IPv4-forbindelser (reachability-test) stadig ikke fungerer, er der gode chancer for, at din internetudbyder (ISP) ikke giver dig en korrekt (offentlig) IPv4-adresse. Der findes flere internetteknologier (slutkunder), som ikke tillader indgående trafik til den IPv4-adresse, som du har fået tildelt. En ufuldstændig liste er følgende: *privat IPv4-adresse*, *DS-Lite-forbindelse* eller *CarrierGrade-NAT (CG-NAT)*. Alle disse deler i princippet en IPv4-adresse på tværs af flere brugere og blokerer således (indgående) trafik fra internettet til dig. Nogle internetudbydere tillader opgradering til såkaldte **full-stack-forbindelser**, som skulle muliggøre fuld dobbeltrettet trafik for IPv4 og IPv6.

source: **Q:** Why do some devices fail to connect for my IPv6 configured NextBox?
da: **Q:** Hvorfor kan nogle enheder ikke oprette forbindelse til min IPv6-konfigurerede NextBox?

source: Sadly, still not all ISPs and mobile-network providers (smartphones) do have full IPv6 support activated. This means, if your NextBox is configured for IPv6 only access, devices inside these networks will not be able to connect. The **backwards-proxy does work as a workaround here**, as it provides an IPv4 entrypoint to your NextBox independant of your other remote access configuration.
da: Desværre er det stadig ikke alle internetudbydere og mobilnetværksudbydere (smartphones), der har fuld IPv6-understøttelse aktiveret. Det betyder, at hvis din NextBox er konfigureret til kun IPv6-adgang, vil enheder i disse netværk ikke kunne oprette forbindelse. **backwards-proxy fungerer som en løsning her**, da den giver et IPv4 indgangspunkt til din NextBox uafhængigt af din anden fjernadgangskonfiguration.

source: Software FAQ
da: Ofte stillede spørgsmål om software

source: **Q:** What kind of public key is expected for SSH access?
da: **Q:** Hvilken slags offentlig nøgle forventes for SSH-adgang?

source: An openssh style (public) key is expected. Depending on your operating system there are different ways to determine your public key. One might be ``ssh-add -L``, another might be ``cat ~/.ssh/id_rsa.pub``. If you are using Putty, please see the `Putty documentation`_.
da: Der forventes en openssh-lignende (offentlig) nøgle. Afhængigt af dit styresystem er der forskellige måder at bestemme din offentlige nøgle på. En kan være ``ssh-add -L``, en anden kan være ``cat ~/.ssh/id_rsa.pub``. Hvis du bruger Putty, skal du se `Putty-dokumentationen`_.

source: **Q:** Can the operating system be extended or configured manually?
da: **Q:** Kan operativsystemet udvides eller konfigureres manuelt?

source: Yes, you can set up ssh access through the NextBox Nextcloud app. Afterwards you can access your NextBox using ssh and you can do with the system whatever you want. Obviously we will only provide support for the NextBox stock configuration.
da: Ja, du kan konfigurere ssh-adgang via NextBox Nextcloud-appen. Herefter kan du få adgang til din NextBox via ssh og du kan gøre med systemet hvad du vil. Vi vil naturligvis kun yde support til NextBox's standardkonfiguration.

source: **Q:** Where can I see a changelog for the NextBox versions?
da: **Q:** Hvor kan jeg se en oversigt over ændringer i NextBox-versionerne?

source: Currently only here: `Launchpad NextBox`_
da: I øjeblikket kun her: `Launchpad NextBox`__

source: **Q:** How can I update the Operating System?
da: **Q:** Hvordan kan jeg opdatere operativsystemet?

source: There is no need to update the NextBox OS by hand. This is done using ``unattended-upgrades`` and on top the *nextbox-daemon* will check for upgrades manually (as a redundant fallback solution) on every start. You are free to update your OS by hand using ``apt``, if you know what you are doing.
da: Det er ikke nødvendigt at opdatere NextBox OS manuelt. Dette gøres ved hjælp af ``unattended-upgrades`` og oven i købet vil *nextbox-daemon* manuelt kontrollere for opgraderinger (som en redundant fallback-løsning) ved hver start. Det står dig frit for at opdatere dit OS i hånden ved hjælp af ``apt``, hvis du ved, hvad du gør.

source: **Q:** Is the NextBox running a 32bit or 64bit operating system?
da: **Q:** Kører NextBoxen et 32bit eller 64bit operativsystem?

source: The used OS is a 64bit system. The ``arch`` output: `aarch64`.
da: Det anvendte OS er et 64bit-system. ``arch`` output: `aarch64`.

source: **Q:** Which users and default passwords are created by default on the NextBox's operating system?
da: **Q:** Hvilke brugere og standard adgangskoder oprettes som standard på NextBox's operativsystem?

source: There is not one single default password set on any (system) user. The only non-system user created is named ``nextuser``, without a default password. The only way to access the NextBox is using ``ssh`` with a public key, which can be set via the NextBox App.
da: Der er ikke fastsat en enkelt standardadgangskode for nogen (system)bruger. Den eneste ikke-systembruger, der er oprettet, hedder ``nextuser``, uden en standardadgangskode. Den eneste måde at få adgang til NextBox på er ved hjælp af ``ssh`` med en offentlig nøgle, som kan indstilles via NextBox-appen.

source: Getting Started
da: Kom godt i gang

source: Quickstart
da: Hurtigstart

source: Connect NextBox to your Internet router via network cable.
da: Tilslut NextBox til din internetrouter via netværkskabel.

source: Connect the power cable to the NextBox, you can use any of the two USB-C ports.
da: Tilslut strømkablet til NextBox, du kan bruge en af de to USB-C-porte.

source: Once powered the NextBox will start
da: Når NextBox er tændt, starter den

source: Wait approx. 5 minutes and open "http://nextbox.local" in your web browser - this duration may vary. The NextBox is ready once the LED is constantly green (see :doc:`LEDs <technical/led-colors>`).
da: Vent ca. 5 minutter, og åbn "http://nextbox.local" i din webbrowser - denne varighed kan variere. NextBoxen er klar, når LED'en er konstant grøn (se :doc:`LED'er <technical/led-colors>`).

source: External storage drives without an external power supply must NOT be connected to the USB sockets. Otherwise, this can lead to data loss on the internal hard disk. **Always use external storage drives with a seperate power supply together with the NextBox.**
da: Eksterne lagerdrev uden ekstern strømforsyning må IKKE tilsluttes til USB-stikkene. Ellers kan dette føre til tab af data på den interne harddisk. **Brug altid eksterne lagerdrev med en separat strømforsyning sammen med NextBox.**

source: Create Admin Account
da: Opret en administratorkonto

source: Enter your desired username and password. Remember to choose a strong password for your admin account.
da: Indtast det ønskede brugernavn og password. Husk at vælge en stærk adgangskode til din administratorkonto.

source: Press "Finish Setup". This process may take a few minutes.
da: Tryk på "Finish Setup". Denne proces kan tage et par minutter.

source: Configure NextBox Related Features
da: Konfigurer NextBox-relaterede funktioner

source: The NextBox comes with Nextcloud App to realize various configurations (e.g., :doc:`backup-restore` or :doc:`Remote Access<remote/index>`) and operations for your NextBox.
da: NextBox leveres med Nextcloud App til at realisere forskellige konfigurationer (f.eks. :doc:`backup-restore` eller :doc:`Remote Access<remote/index>`) og operationer for din NextBox.

source: Your can find the NextBox-App in Nextcloud's top level navigation, as shown in this figure:
da: Du kan finde NextBox-App'en i Nextcloud's navigation på øverste niveau, som vist i denne figur:

source: Ready To Go
da: Klar til at gå

source: This is all it takes to get started with your NextBox. From this point you are free to choose how you would like to make the best use of your personal Nextcloud-powered cloud. To get you started, here is a collection of ideas to continue on:
da: Det er alt, hvad der skal til for at komme i gang med din NextBox. Fra dette punkt kan du frit vælge, hvordan du ønsker at gøre bedst mulig brug af din personlige Nextcloud-drevne sky. For at hjælpe dig i gang er her en samling idéer til at fortsætte:

source: **Set up remote access for your NextBox** to allow access to your private cloud from the internet. Our :doc:`guide <remote/index>` covers various approaches.
da: **Sæt fjernadgang til din NextBox** op for at give adgang til din private cloud fra internettet. Vores :doc:`guide <remote/index>` dækker forskellige fremgangsmåder.

source: We prepared a *one-click* remote access method, allowing you to set up basic remote access in seconds.
da: Vi har forberedt en metode til fjernadgang med *et enkelt klik*, så du kan oprette grundlæggende fjernadgang på få sekunder.

source: **Connect your devices to your NextBox.** For smartphones the official `Android App`_ and `iOS App`_ are both great additions for your personal cloud. Apart from these there are also `Windows, macOS, Linux clients`_ available, which integrate seamlessly into the OS of your choice. For Android smartphones you might want to read our pictured :doc:`guide <clients/android>`.
da: **Opkobl dine enheder til din NextBox.** For smartphones er den officielle `Android App`_ og `iOS App`_ begge gode tilføjelser til din personlige cloud. Ud over disse er der også `Windows-, macOS- og Linux-klienter`_ til rådighed, som integreres problemfrit i det operativsystem, du vælger. For Android-smartphones kan du måske læse vores afbildede :doc:`guide <clients/android>`.

source: **Browse the vast amount of apps** for your Nextcloud at the `official store`_ for Nextcloud apps. Alternatively, just browse, find and install directly from within your NextBox via the built-in app manager and browser.
da: **Se det store udvalg af apps** til din Nextcloud i `officielle butik`_ for Nextcloud-apps. Alternativt kan du bare gennemse, finde og installere direkte fra din NextBox via den indbyggede app-manager og browser.

source: **Extend your Dashboard** using the various `Dashboard Integrations`_ to create your personal information hub.
da: **Udbyg dit Dashboard** ved hjælp af de forskellige `Dashboard Integrations`_ for at skabe dit personlige informationscenter.

source: **Share photos, documents, any files, bookmarks and much more with your family and friends**, or become part of a `Federation`_ and share, communicate and collaborate with other Nextcloud users.
da: **Del fotos, dokumenter, filer, bogmærker og meget mere med din familie og dine venner**, eller bliv en del af en `Federation`_ og del, kommunikér og samarbejd med andre Nextcloud-brugere.

source: **Your communications under your control** - use Nextcloud's powerful `groupware apps`_ like *Mail*, *Contacts*, *Calendar* or even *Deck* to have all your personal data under your control or to organize and work together with others.
da: **Din kommunikation under din kontrol** - brug Nextcloud's kraftfulde `groupware-apps`_ som *Mail*, *Contacts*, *Calendar* eller endda *Deck* til at have alle dine personlige data under din kontrol eller til at organisere og arbejde sammen med andre.

source: More interested in :doc:`technical details <technical/index>`? Or in Open-Source in general? Then head over to the NextBox `repositories`_ at GitHub, leave a star, contribute or discuss latest ideas and plans with us.
da: Er du mere interesseret i :doc:`tekniske detaljer <technical/index>`? Eller i Open-Source generelt? Så gå over til NextBox `repositories`_ på GitHub, efterlad en stjerne, bidrag eller diskuter de seneste idéer og planer med os.

source: Hardware Overview
da: Overblik over hardware

source: Summary
da: Resumé

source: A NextBox consists of the following hardware components:
da: En NextBox består af følgende hardwarekomponenter:

source: Nitrokey NextBox (aluminum) case
da: Nitrokey NextBox (aluminium) kuffert

source: Internal hard-drive (SSD or HDD)
da: Intern harddisk (SSD eller HDD)

source: NextBox Reset Shield
da: NæsteBox Reset Shield

source: Various smaller parts (internal wiring, connectors)
da: Diverse mindre dele (interne ledninger, stik)
