Repository: Nitrokey/nitrokey-doc
Catalog: locales/*/LC_MESSAGES/nextbox.po
Languages: da

source: Backup and Restore
da: Sikkerhedskopiering og gendannelse

source: The NextBox can be backupped and restored from within the NextBox Nextcloud App. In order to execute a backup or restore operation you need to have a storage device attached to your NextBox.
da: NextBoxen kan backuppes og gendannes fra NextBox Nextcloud Appen. For at kunne udføre en backup eller gendannelse skal du have en lagerenhed tilsluttet din NextBox.

source: To enable backup and restore onto a storage device please follow these steps:
da: For at aktivere sikkerhedskopiering og gendannelse på en lagerenhed skal du følge disse trin:

source: Make sure your storage device contains at least one partition formatted with a supported file-system (currently *ext* and *xfs* are supported).
da: Sørg for, at din lagerenhed indeholder mindst én partition, der er formateret med et understøttet filsystem (i øjeblikket understøttes *ext* og *xfs*).

source: Attach the storage device to your NextBox to any of the USB ports and *remember to use an external power supply* (:ref:`more information<usb-power-supply>`)
da: Tilslut lagerenheden til din NextBox til en af USB-portene, og *husk at bruge en ekstern strømforsyning* (:ref:`mere information<usb-power-supply>`)

source: Once attached you will see the storage(s) inside "Storage Management" below "Available Storages"
da: Når den er tilsluttet, kan du se lageret/lagrene i "Lagerstyring" under "Tilgængelige lagre"

source: Click on the plus-symbol on the right side to *mount* your storage and make it available for backup and restore operations. The added storage is now listed inside "Mounted Storages".
da: Klik på plus-symbolet i højre side for at *montere* dit lager og gøre det tilgængeligt for backup- og gendannelsesoperationer. Det tilføjede lager er nu opført i "Mounted Storages".

source: To backup your NextBox including all Nextcloud settings apps and data please follow these steps:
da: For at sikkerhedskopiere din NextBox, herunder alle Nextcloud-indstillinger, apps og data, skal du følge disse trin:

source: Make sure you have a storage mounted as described above
da: Sørg for, at du har et lager monteret som beskrevet ovenfor

source: Inside "Backup / Restore" below "Full System Backup" select the storage device for backup from the drop-down menu named: "Select Backup Device"
da: Inde i "Backup / Restore" under "Full System Backup" vælg lagerenheden til backup fra drop-down-menuen med navnet: "Select Backup Device"

source: Now you have the option to incrementally update an existing backup from the drop-down menu named: "Select Backup Location" **or** create a entirely new backup by entering a name into the "Name of the new backup" entry field.
da: Nu har du mulighed for at opdatere en eksisterende sikkerhedskopi trinvis fra drop-down-menuen med navnet: "Select Backup Location" **eller** oprette en helt ny sikkerhedskopi ved at indtaste et navn i indtastningsfeltet "Name of the new backup" (Navn på den nye sikkerhedskopi").

source: Click "Start Backup now", the backup process will begin immediately.
da: Klik på "Start backup nu", så starter backup-processen med det samme.

source: The resulting backup is not encrypted so take care who has access to the used storage.
da: Den resulterende sikkerhedskopi er ikke krypteret, så du skal være opmærksom på, hvem der har adgang til det anvendte lager.

source: Restore
da: Gendan

source: The restore operation replaces the Nextcloud internals entirely and depending on the version combination this might lead to undefined behavior of the Nextcloud frontend. If this happens, please be patient and reload the page using ``F5`` or ``ctrl-r`` and check, if the restore operation was successful.
da: Gendannelsesoperationen erstatter Nextcloud-internals fuldstændigt, og afhængigt af versionskombinationen kan dette føre til udefineret adfærd i Nextcloud-frontendensen. Hvis dette sker, skal du være tålmodig og genindlæse siden ved hjælp af ``F5`` eller ``ctrl-r`` og kontrollere, om gendannelsesoperationen lykkedes.

source: Make sure your have a storage mounted as described above and it contains a backup to be restored
da: Sørg for, at du har et lager monteret som beskrevet ovenfor, og at det indeholder en sikkerhedskopi, der skal gendannes

source: Inside "Backup / Restore" below "Restore System from Backup" use the "Select Backup to Restore" drop-down menu to select a backup to be restored
da: Inde i "Backup / Restore" under "Restore System from Backup" brug "Select Backup to Restore" drop-down-menuen til at vælge en backup, der skal gendannes

source: Click "Start Restoring now", the restore process will begin immediately.
da: Klik på "Start gendannelse nu", og gendannelsesprocessen begynder straks.

source: Depending on the backupped Nextcloud version after the restore process you will be asked to run the upgrade process for Nextcloud.
da: Afhængigt af den backuppede Nextcloud-version vil du efter gendannelsesprocessen blive bedt om at køre opgraderingsprocessen for Nextcloud.

source: All configurations and settings of the NextBox and the Nextcloud instance will be restored, thus there might be changes on how you access your NextBox, if the restored Remote Access configuration is not identical to the current one.
da: Alle konfigurationer og indstillinger for NextBoxen og Nextcloud-instansen vil blive gendannet, og der kan derfor være ændringer i den måde, du får adgang til din NextBox, hvis den gendannede fjernadgangskonfiguration ikke er identisk med den nuværende.

source: Connect Your Android or iOS Smartphone
da: Tilslut din Android- eller iOS-smartphone

source: Connect the NextBox with your smartphone
da: Forbind NextBox med din smartphone

source: Download the Nextcloud app from the app store or play store.
da: Download Nextcloud-appen fra app-butikken eller Play Store.

source: Cick on "Sign in".
da: Klik på "Log ind".

source: Enter your domain.
da: Indtast dit domæne.

source: Enter your username and password and click "Log in".
da: Indtast dit brugernavn og din adgangskode, og klik på "Log ind".

source: Now you have access to your NextBox with your smartphone!
da: Nu har du adgang til din NextBox med din smartphone!

source: Connect Devices
da: Forbind enheder

source: Choose your operating system or device:
da: Vælg dit styresystem eller din enhed:

source: Connect Your Linux Computer
da: Tilslut din Linux-computer

source: Connect using the Nextcloud App
da: Opret forbindelse ved hjælp af Nextcloud-appen

source: Download the client application from: https://nextcloud.com/install/
da: Download klientprogrammet fra: https://nextcloud.com/install/

source: Most distributions do provide the Nextcloud client via their package managers. (e.g., Ubuntu, Arch Linux, Mint, ...)
da: De fleste distributioner leverer Nextcloud-klienten via deres pakkehåndtering. (f.eks. Ubuntu, Arch Linux, Mint, ...)

source: After starting the ``nextcloud`` application, you will find it as a tray icon.
da: Når du har startet ``nextcloud`` programmet, vil du finde det som et ikon i bakken.

source: Add an account using your public server url, username and password. Further you can choose the target directory the files should be synced to.
da: Tilføj en konto ved at bruge din offentlige server-url, brugernavn og adgangskode. Desuden kan du vælge den målmappe, som filerne skal synkroniseres til.

source: Connect using WebDAV
da: Opret forbindelse ved hjælp af WebDAV

source: Mounting Nextcloud using WebDAV can be done directly via most file managers, by adding a "remote server".
da: Montering af Nextcloud ved hjælp af WebDAV kan gøres direkte via de fleste filhåndteringsprogrammer ved at tilføje en "fjernserver".

source: Additionally you can mount your Nextcloud files using WebDAV via commandline and `/etc/fstab` by installing the `davfs2` package.
da: Derudover kan du montere dine Nextcloud-filer ved hjælp af WebDAV via kommandolinjen og `/etc/fstab` ved at installere pakken `davfs2`.

source: To mount use:
da: Brug til montering:

source: Connect your Mac Commputer
da: Tilslut din Mac-computer

source: Download the Nextcloud client application: https://nextcloud.com/install/
da: Download Nextcloud-klientprogrammet: https://nextcloud.com/install/

source: After installation, click "Log in to your Nextcloud". Afterwards please provide your Nextcloud's domain.
da: Efter installationen skal du klikke på "Log ind på din Nextcloud". Herefter skal du angive dit Nextcloud's domæne.

source: Provide your username and password and click "Log in".
da: Indtast dit brugernavn og din adgangskode, og klik på "Log ind".

source: Inside the menu bar there will be a Nextcloud icon to open the Nextcloud application settings.
da: I menulinjen vil der være et Nextcloud-ikon for at åbne indstillingerne for Nextcloud-programmet.

source: Inside *Finder* below "favorites" you will find a "Nextcloud" directory with the user's files.
da: Inde i *Finder* under "favoritter" finder du en "Nextcloud" mappe med brugerens filer.

source: Inside *Finder*, open *Go* and choose *Connect to Server*
da: I *Finder* skal du åbne *Gå* og vælge *Forbind til server*.

source: Provide the WebDAV URL `https://yourdomain.xyz/remote.php/webdav`
da: Angiv WebDAV-URL'en `https://yourdomain.xyz/remote.php/webdav`.

source: In the next step, provide the username and password to login to your Nextcloud instance.
da: I det næste trin skal du angive brugernavn og adgangskode for at logge ind på din Nextcloud-instans.

source: Once finished you can find your Nextcloud files in *Locations*.
da: Når du er færdig, kan du finde dine Nextcloud-filer i *Locations*.

source: Inside the tray there will be a Nextcloud icon to open the Nextcloud application settings.
da: I bakken vil der være et Nextcloud-ikon for at åbne indstillingerne for Nextcloud-programmet.

source: Inside the file-explorer you can now find your Nextcloud instance files.
da: I filudforskeren kan du nu finde dine Nextcloud-instansfiler.

source: There have been reports that the native WebDAV support in Windows is not performing well. We recommend using the Nextcloud App (as described above) for the best user experience. Additionally please read `Nextcloud's Windows WebDAV Known Problems`_.
da: Der har været rapporter om, at den native WebDAV-understøttelse i Windows ikke fungerer godt. Vi anbefaler at bruge Nextcloud-appen (som beskrevet ovenfor) for at få den bedste brugeroplevelse. Læs desuden `Nextcloud's Windows WebDAV Known Problems`_.

source: Add a WebDAV drive using the file explorer's "Add a network location" icon. (You can also use "Map network drive" to bind your Nextcloud to a drive, like *Z:*).
da: Tilføj et WebDAV-drev ved hjælp af ikonet "Tilføj en netværksplacering" i File Explorer's. (Du kan også bruge "Map network drive" til at binde din Nextcloud til et drev, som f.eks. *Z:*).

source: In the following dialog please enter the full WebDAV address of your NextBox: ``https://my.domain.tld/remote.php/dav/files/USERNAME``. Replace *my.domain.tld* with your NextBox's public domain and *USERNAME* with the username you would like to connect.
da: I den følgende dialogboks skal du indtaste den fulde WebDAV-adresse på din NextBox: ``https://my.domain.tld/remote.php/dav/files/USERNAME``. Udskift *my.domain.tld* med din NextBox's offentlige domæne og *USERNAME* med det brugernavn, du ønsker at oprette forbindelse til.

source: In the following window insert your full Nextcloud credentials, means your username and password you use to login into your Nextcloud.
da: I det følgende vindue skal du indsætte dine fulde Nextcloud-oplysninger, dvs. dit brugernavn og din adgangskode, som du bruger til at logge ind på din Nextcloud.

source: Now your files from your Nextcloud instance are accessible via the file-explorer.
da: Nu er dine filer fra din Nextcloud-instans tilgængelige via filekspert.

source: Generic FAQ
da: Generisk FAQ

source: **Q:** How can I factory-reset my NextBox?
da: **Q:** Hvordan kan jeg nulstille min NextBox fra fabrikken?

source: Press the hardware button for 5 seconds, see :doc:`../technical/factory-reset`. To press the button use a thin (~1mm) pin like a smartphone sim-card tray removal device.
da: Tryk på hardwareknappen i 5 sekunder, se :doc:`../technical/factory-reset`. For at trykke på knappen skal du bruge en tynd (~1 mm) pin som en anordning til fjernelse af sim-kortbakken på en smartphone.

source: **Q:** What do the different LED colors mean?
da: **Q:** Hvad betyder de forskellige LED-farver?

source: The detailed document can be found here: :doc:`../technical/led-colors`
da: Det detaljerede dokument kan findes her: :doc:`../technical/led-colors`.

source: **Q:** Can the inital setup be done using a monitor & keyboard?
da: **Q:** Kan den indledende opsætning foretages ved hjælp af en skærm & tastatur?

source: No, this is not possible as the regular login is disabled on delivery. Please connect the the NextBox to a network and access the NextBox using `nextbox.local`_ or the IP directly.
da: Nej, det er ikke muligt, da det almindelige login er deaktiveret ved levering. Slut NextBoxen til et netværk og få adgang til NextBoxen ved hjælp af `nextbox.local`_ eller IP direkte.

source: **Q:** What is the typical power consumption?
da: **Q:** Hvad er det typiske strømforbrug?

source: The minimum of 0,6A (3W) is rarely reached, in idle mostly around 1A (5W) and more than 2A (10W) under higher loads.
da: Minimumsværdien på 0,6A (3W) nås sjældent, i tomgang oftest omkring 1A (5W) og mere end 2A (10W) under højere belastninger.

source: **Q:** How secure is the NextBox?
da: **Q:** Hvor sikker er NextBox?

source: Debian with frequent `unattended-upgrades` based security updates, a minimal attack surface by ensuring that not a single unneccessary port is open are the main contributors to system security. **Make sure your Nextcloud users and passwords are on a high level, either with long-random passwords or a 2-Factor-Authentification supported login method with e.g., a Nitrokey FIDO2.**
da: Debian med hyppige `unattended-upgrades`-baserede sikkerhedsopdateringer, en minimal angrebsflade ved at sikre, at ikke en eneste unødvendig port er åben, er de vigtigste bidrag til systemsikkerheden. **Sørg for, at dine Nextcloud-brugere og adgangskoder er på et højt niveau, enten med lange tilfældige adgangskoder eller en login-metode med understøttelse af 2-faktor-autentifikation med f.eks. en Nitrokey FIDO2.**

source: **Q:** What do all the ssh-related "warnings" mean?
da: **Q:** Hvad betyder alle de ssh-relaterede "advarsler"?

source: Once you set up your ssh-access, you make yourself technically responsible for your NextBox. We do provide help as good as we can as goodwill, but under the line we cannot provide generic Linux-administration support outside of the intended NextBox use-cases.
da: Når du har oprettet din ssh-adgang, gør du dig selv teknisk ansvarlig for din NextBox. Vi yder hjælp så godt vi kan som goodwill, men vi kan ikke yde generisk Linux-administrationssupport uden for de tiltænkte NextBox-brugstilfælde.

source: **Q:** Can I mirror my NextBox onto another NextBox?
da: **Q:** Kan jeg spejle min NextBox på en anden NextBox?

source: This translates to a cluster setup, which is considered an (paid) enterprise solution by Nextcloud. The details, especially data consistency and collision handling, are far from trivial to realize. Nevertheless, we also see demand for more sophisticated backup solutions and will address this issue.
da: Dette svarer til en klyngeopsætning, som Nextcloud betragter som en (betalt) virksomhedsløsning. Detaljerne, især datakonsistens og kollisionshåndtering, er langt fra trivielle at realisere. Ikke desto mindre ser vi også efterspørgsel efter mere sofistikerede backup-løsninger og vil tage fat på dette spørgsmål.

source: **Q:** What to do to run/install/fix Nextcloud App "XYZ"? Why does Nextcloud feature XYZ not work?
da: **Q:** Hvad skal jeg gøre for at køre/installere/rette Nextcloud App "XYZ"? Hvorfor virker Nextcloud-funktionen XYZ ikke?

source: Generally we cannot help in detail for these topics. Nextcloud internals and apps are out-of-scope for the NextBox development as we use the stock Docker images provided by Nextcloud. Ultimately, if some NextBox/OS configuration is blocking an app to run properly we for sure will look into fixing it.
da: Generelt kan vi ikke hjælpe i detaljer med disse emner. Nextcloud-interne funktioner og apps er uden for NextBox-udviklingen, da vi bruger de standard Docker-images, som leveres af Nextcloud. I sidste ende, hvis en NextBox/OS-konfiguration blokerer for at en app kan køre korrekt, vil vi helt sikkert se på at rette det.

source: **Q:** Can I connect/use the NextBox using WiFi?
da: **Q:** Kan jeg tilslutte/bruge NextBoxen via WiFi?

source: No, currently this is not (easily) possible, only wired ethernet using RJ-45 is available.
da: Nej, i øjeblikket er det ikke (let) muligt, kun kabelbaseret ethernet via RJ-45 er tilgængeligt.

source: **Q:** Is the WiFi on the Raspberry PI 4B physically available and working?
da: **Q:** Er WiFi på Raspberry PI 4B fysisk tilgængelig og fungerer det?

source: Yes, physically the WiFi is available and working, but not used/managed by the NextBox App. If you know what you are doing you can configure and use it, if works although being inside the NextBox casing.
da: Ja, fysisk er WiFi tilgængeligt og fungerer, men det bruges/administreres ikke af NextBox-appen. Hvis du ved, hvad du gør, kan du konfigurere og bruge det, hvis det virker, selv om det er inde i NextBox-kabinettet.

source: Hardware FAQ
da: Ofte stillede spørgsmål om hardware

source: **Q:** Why must I not connect external hard-drives without an external power-supply to my NextBox?
da: **Q:** Hvorfor må jeg ikke tilslutte eksterne harddiske uden en ekstern strømforsyning til min NextBox?

source: The Raspberry Pi 4 Model B can only supply 1.2A of power through USB (see `RPi Power Supply`_). The internal hard-drive is already connected and powered via USB and pulls ~1.0A. Thus connecting another hard-drive without an external power supply can lead to an unreliable power supply for the internal hard-drive, thus potential data loss.
da: Raspberry Pi 4 Model B kan kun levere 1,2 A strøm via USB (se `RPi Power Supply`_). Den interne harddisk er allerede tilsluttet og forsynet med strøm via USB og trækker ~1,0A. Hvis man således tilslutter en anden harddisk uden en ekstern strømforsyning, kan det føre til en upålidelig strømforsyning til den interne harddisk og dermed potentielt tab af data.

source: **Q:** Where can I find an external hard-drive with its own power supply?
da: **Q:** Hvor kan jeg finde en ekstern harddisk med egen strømforsyning?

source: The smaller form factors (2.5'' and smaller) for external hard-drives mostly come without an additional power supply. For these, *a USB Hub with an additional power supply can be considered the "external power-supply"* for the hard-drive. Although the latter is it not 100% sure for powered USB hubs, thus we recommend external 3.5'' hard-drives, which are nearly always externally powered.
da: De mindre formfaktorer (2,5'' og mindre) for eksterne harddiske leveres for det meste uden en ekstra strømforsyning. I disse tilfælde kan * en USB-hub med en ekstra strømforsyning betragtes som "ekstern strømforsyning"* for harddisken. Selv om sidstnævnte er det ikke 100% ssikkert for drevne USB-hubs, anbefaler vi derfor eksterne 3,5'' harddiske, som næsten altid er eksternt drevne.

source: **Q:** Why does my USB device / hub not work, if connected to the NextBox?
da: **Q:** Hvorfor virker min USB-enhed / hub ikke, hvis den er tilsluttet NextBox?

source: There are some devices and especially USB3 hubs that are known to not work properly with the Raspberry PI 4B, please see this `USB Documentation`_ from Raspberry. On top of that also make sure the USB device is working in general by connecting it to another computer (best case: Linux) and verify that it works.
da: Der er nogle enheder og især USB3-hubs, der er kendt for ikke at fungere korrekt med Raspberry PI 4B, se venligst denne `USB-dokumentation`_ fra Raspberry. Derudover skal du også sikre dig, at USB-enheden generelt virker ved at tilslutte den til en anden computer (i bedste fald Linux) og kontrollere, at den virker.

source: **Q:** Why does my hard-drive not show up after plugging it in?
da: **Q:** Hvorfor vises min harddisk ikke, når jeg har sat den i stikket?

source: Please make sure that you are using one of the supported filesystems (e.g., ext, xfs) and you have mounted your hard-drive within *Storage Management*.
da: Sørg for, at du bruger et af de understøttede filsystemer (f.eks. ext, xfs), og at du har monteret harddisken i *Storage Management*.

source: **Q:** Can I generally extend the NextBox using a USB hard-drive?
da: **Q:** Kan jeg generelt udvide NextBoxen med en USB-harddisk?

source: Yes, this is possible, please make sure you are using a hard-drive, which has an external power supply. Once connected you can mount the hard-drive using the NextBox *Storage Management* and include it into Nextcloud file-management using the `External storage support`_ app.
da: Ja, det er muligt, men du skal sikre dig, at du bruger en harddisk, der har en ekstern strømforsyning. Når den er tilsluttet, kan du montere harddisken ved hjælp af NextBox *Storage Management* og inkludere den i Nextcloud filhåndtering ved hjælp af `External storage support`_ appen.

source: **Q:** What functions does the additional "shield" provide?
da: **Q:** Hvilke funktioner har det ekstra "skjold"?

source: As of now the shield does provide a :doc:`status LED <../technical/led-colors>`, a hardware button to :doc:`factory reset <../technical/factory-reset>` and an additional USB Type-C connector on the same side as the Ethernet port for power supply exclusively.
da: Fra nu af har skjoldet en :doc:`status-LED <../technical/led-colors>`, en hardwareknap til :doc:`fabriks-nulstilling <../technical/factory-reset>` og et ekstra USB Type-C-stik på samme side som Ethernet-porten til udelukkende strømforsyning.

source: **Q:** Is the NextBox hardware extendable/replaceable?
da: **Q:** Kan NextBox-hardwaren udvides/udskiftes?

source: Yes, all NextBox components can be easily replaced. None of the components are glued or somehow permanently assembled. Using a Phillips screwdriver you can disassemble and re-assemble the NextBox easily. Keep in mind that you are doing this at your own risk.
da: Ja, alle NextBox-komponenter kan nemt udskiftes. Ingen af komponenterne er limet eller på anden måde permanent monteret. Ved hjælp af en Phillips-skruetrækker kan du nemt adskille og samle NextBoxen igen. Husk, at du gør dette på eget ansvar.

source: **Q:** What are the two USB Type-C ports used for?
da: **Q:** Hvad bruges de to USB Type-C-porte til?

source: Both USB Type-C ports are exclusively for power supply and can not be used for data transfer. Do not connect two power supplies, please just use one of both to power your NextBox.
da: Begge USB Type-C-porte er udelukkende beregnet til strømforsyning og kan ikke bruges til dataoverførsel. Du må ikke tilslutte to strømforsyninger, men skal blot bruge en af dem begge til at forsyne din NextBox.

source: **Q:** Which fan should I install?
da: **Q:** Hvilken ventilator skal jeg installere?
