Repository: Nitrokey/nitrokey-doc
Catalog: locales/*/LC_MESSAGES/nextbox.po
Languages: da

source: The casing is made out of aluminum and a passive thermal design. There are no glued components and the case can easily be opened using a Phillips screwdriver. Please keep in mind that opening the case will void your warranty and it is generally not recommended to open the case for the non-professional user, especially as this might damage the thermal conductivity and therefore the heat dissipating capabilities of the NextBox might suffer.
da: Kabinettet er fremstillet af aluminium og har et passivt termisk design. Der er ingen limede komponenter, og kabinettet kan nemt åbnes med en Phillips-skruetrækker. Husk venligst, at åbning af kabinettet vil ugyldiggøre din garanti, og det anbefales generelt ikke at åbne kabinettet for den ikke-professionelle bruger, især da dette kan skade den termiske ledningsevne, og derfor kan NextBox's varmeafledningskapacitet lide skade.

source: Connectors and Interfaces
da: Stik og grænseflader

source: In general the NextBox exposes all ports, which are available on the Raspberry PI 4 and one additional USB Type C port for a better accessible power supply connector. In the following a short description of the different connectors and interfaces is given.
da: Generelt har NextBox alle de porte, der er tilgængelige på Raspberry PI 4, samt en ekstra USB Type C port til et bedre tilgængeligt strømforsyningsstik. I det følgende gives en kort beskrivelse af de forskellige stik og grænseflader.

source: :doc:`Status LED<technical/led-colors>`
da: :doc:`Status LED<teknisk/led-colors>`

source: Hardware button for :doc:`Factory-Reset<technical/factory-reset>`
da: Hardware-knap til :doc:`Factory-Reset<teknisk/factory-reset>`

source: **USB Type-C / Power Supply** connector is designated as a replacement for the stock connector on the front side and is exclusively for supplying power to the NextBox and cannot transfer data.
da: **USB Type-C / Power Supply**-stikket er beregnet som en erstatning for det originale stik på forsiden og er udelukkende beregnet til at levere strøm til NextBox og kan ikke overføre data.

source: The right side of the NextBox is designed so that all mandatory interfaces can be accessed from this side.
da: Højre side af NextBox er designet således, at alle obligatoriske grænseflader kan tilgås fra denne side.

source: The **RJ45 - 1GbE Ethernet** connector connects your NextBox with your home network and shall stay connected at all times.
da: **RJ45 - 1GbE Ethernet**-stikket forbinder din NextBox med dit hjemmenetværk og skal altid være tilsluttet.

source: **Free USB 3 - Type A Slot**, please see :ref:`Hardware FAQ<usb-power-supply>`
da: **Ledig USB 3 - Type A-stik**, se venligst :ref:`Hardware FAQ<usb-power-supply>`

source: **Reserved USB 3 - Type A Slot**, used for the internal hard-disk. *Never remove this connector!*
da: **Reserveret USB 3 - Type A-stik**, der bruges til den interne harddisk. *Fjern aldrig dette stik!*

source: **2x Free USB 2 - Type A Slots**, please see :ref:`Hardware FAQ<usb-power-supply>`
da: **2x Ledig USB 2 - Type A slots**, se venligst :ref:`Hardware FAQ<usb-power-supply>`

source: Using a hard-drive with an external power supply you can use any of the available USB slots. Keep in mind that the data transfer bandwidth for the USB 2 slots is less compared to the USB 3 slot.
da: Hvis du bruger en harddisk med en ekstern strømforsyning, kan du bruge et af de tilgængelige USB-slots. Husk på, at dataoverførselsbåndbredden for USB 2-pladserne er mindre end for USB 3-pladserne.

source: **USB Type-C / Power Supply** (stock) connector, can be used as **[3]**
da: **USB Type-C / Power Supply** (lager) stik, kan bruges som **[3]**

source: **Micro HDMI 1 slot**, usable but not needed.
da: **Micro HDMI 1 slot**, kan bruges, men er ikke nødvendig.

source: **Micro HDMI 2 slot**, usable but not needed.
da: **Micro HDMI 2-stik**, kan bruges, men er ikke nødvendigt.

source: **Headphone Jack**, usable but not needed.
da: **Hovedtelefonstik**, kan bruges, men er ikke nødvendigt.

source: The front interfaces are all optional and not necessary for NextBox usage in general. While the **USB Type-C/Power Supply** may be used, the alternative on the right side of the NextBox can be used to have all wiring convenient on one side.
da: De forreste grænseflader er alle valgfrie og ikke nødvendige for brug af NextBox generelt. Mens **USB Type-C/Power Supply** kan bruges, kan alternativet på højre side af NextBox bruges til at have alle ledninger praktisk på den ene side.

source: DNS Rebind Protection
da: Beskyttelse af DNS Rebind

source: Issue
da: Spørgsmål

source: You have your dynamic DNS correctly set up, but IPv6 resolving does not work for your domain.
da: Du har konfigureret din dynamiske DNS korrekt, men IPv6-opløsning fungerer ikke for dit domæne.

source: Details
da: Detaljer

source: In general DNS Rebinding protection is a safety mechanism to avoid attacks based on `DNS-Rebinding`_. Home routers include a protection mechanism for this attack by never returning a local IP (v4 & v6) address.
da: Generelt er DNS Rebinding-beskyttelse en sikkerhedsmekanisme til at undgå angreb baseret på `DNS-Rebinding`_. Hjemme-routere indeholder en beskyttelsesmekanisme mod dette angreb ved aldrig at returnere en lokal IP-adresse (v4 & v6).

source: In the context of the NextBox this means that, if you are using IPv6, the IPv6 address of your NextBox is considered local by your router and thus wiull not be returned during DNS resolving of your designated domain.
da: I forbindelse med NextBox betyder dette, at hvis du bruger IPv6, så betragtes IPv6-adressen på din NextBox som lokal af din router og vil derfor ikke blive returneret under DNS-opløsning af dit udpegede domæne.

source: For IPv4 this is also applies, but not a problem. In the IPv4 world (dynamic) DNS resolves to the router (WAN-IP) itself and the router will forward the traffic to your NextBox. In contrast IPv6 will not resolve to your router but to the IPv6 address of your NextBox directly and the router just has to open its firewall for the traffic to pass.
da: For IPv4 gælder dette også, men det er ikke et problem. I IPv4-verdenen (dynamisk) DNS opløser til routeren (WAN-IP) selv og routeren vil videresende trafikken til din NextBox. I modsætning hertil vil IPv6 ikke løse op til din router, men til IPv6-adressen på din NextBox direkte, og routeren skal blot åbne sin firewall for at trafikken kan passere.

source: Solution
da: Løsning

source: Most routers, which implement this DNS-Rebind protection also allow you to whitelist certain domains from this protection. **Generally, to solve this issue you have to insert your (full) domain to the DNS-Rebind Exceptions (or whitelist) of your router.**
da: De fleste routere, der implementerer denne DNS-Rebind-beskyttelse, giver dig også mulighed for at skrive visse domæner på en whitelist, så de ikke er omfattet af denne beskyttelse. **For at løse dette problem skal du som regel indsætte dit (fulde) domæne i din routers DNS-Rebind Exceptions (eller whitelist).**

source: For instance, the setting inside a *Fritz!Box* is to be found in: "Home Network -> Network -> Network Settings -> More Settings -> DNS Rebind Protection". You need to ensure that you have the "extended/expert view" activated.
da: Indstillingen i en *Fritz!Box* findes f.eks. i: "Home Network -> Network -> Network -> Network Settings -> More Settings -> DNS Rebind Protection". Du skal sikre dig, at du har "udvidet/ekspert visning" aktiveret.

source: Dynamic DNS Setup
da: Opsætning af dynamisk DNS

source: **There are two ways to configure a dynamic DNS provider to be used and updated by your NextBox instance.**
da: **Der er to måder at konfigurere en dynamisk DNS-udbyder til at blive brugt og opdateret af din NextBox-instans.**

source: In contrast to the :doc:`backwards proxy <proxy>` remote access method, this approach will ensure full end-to-end encryption using your very own TLS certificate acquired from `Let's Encrypt`_.
da: I modsætning til :doc:`backwards proxy <proxy>`-metoden til fjernadgang sikrer denne fremgangsmåde fuld end-to-end-kryptering ved hjælp af dit eget TLS-certifikat, som du får fra `Let's Encrypt`_.

source: Guided Dynamic DNS
da: Vejledt dynamisk DNS

source: The guided setup will register an account at `desec.io`_ for you. Please follow these steps to configure your NextBox using the Guided Dynamic DNS method:
da: Den guidede opsætning registrerer en konto på `desec.io`_ for dig. Følg disse trin for at konfigurere din NextBox ved hjælp af den guidede dynamiske DNS-metode:

source: In step one you need to provide an e-mail address and the domain you would like to register. Please make sure that you have access to this e-mail account and the domain ends with **.dedyn.io**. *You can continue to the next step by registering at `desec.io`_ or without (e.g., if you have already registered this domain before)*
da: I første trin skal du angive en e-mailadresse og det domæne, du ønsker at registrere. Sørg for, at du har adgang til denne e-mail-konto, og at domænet slutter med **.dedyn.io**. *Du kan fortsætte til næste trin ved at registrere på `desec.io`_ eller uden (f.eks. hvis du allerede har registreret dette domæne før)*

source: After the registration at `desec.io`_ you will receive a verification e-mail, which will guide you through the registration process at `desec.io`_. Once completed you will be presented with a secret token, which is needed in step two.
da: Efter registreringen på `desec.io`_ vil du modtage en bekræftelsesmail, som vil guide dig gennem registreringsprocessen på `desec.io`_. Når du er færdig, får du et hemmeligt token, som du skal bruge i trin to.

source: If you do not receive a verification e-mail try `reset password`_ (using the same e-mail address) at `desec.io`_ to set a password, which will allow you to login into your account.
da: Hvis du ikke modtager en bekræftelsesmail, kan du prøve `reset password`_ (med samme e-mailadresse) på `desec.io`_ for at indstille et password, så du kan logge ind på din konto.

source: In step two the just acquired secret token shall be inserted into the input field to complete your guided dynamic dns configuration.
da: I trin to skal det netop erhvervede hemmelige token indsættes i indtastningsfeltet for at fuldføre din guidede dynamiske dns-konfiguration.

source: Your token will only be presented once to you (after the verification process). If you need a new token, you need to create a new one inside the `token management`_ inside your `desec.io`_ account settings.
da: Dit token vil kun blive vist dig én gang (efter bekræftelsesprocessen). Hvis du har brug for et nyt token, skal du oprette et nyt i `token management`_ i dine `desec.io`_ kontoindstillinger.

source: Once the 2nd step is completed you can *Continue to TLS activation* - see below...
da: Når det andet trin er gennemført, kan du *Fortsætte til TLS-aktivering* - se nedenfor...

source: Custom Dynamic DNS
da: Brugerdefineret dynamisk DNS

source: To update your dynamic DNS provider with your currently used IP(s), NextBox is using `ddclient`_, which can be directly configured here or via the *Guided DNS* method described before.
da: For at opdatere din dynamiske DNS udbyder med dine aktuelt anvendte IP(s), bruger NextBox `ddclient`_, som kan konfigureres direkte her eller via *Guided DNS* metoden beskrevet tidligere.

source: In this configuration you need the provide the *domain* this configuration is enabling and the contents of the `ddclient.conf` used by `ddclient`_. Various examples can be found at the `official documentation`_, the one used for the guided DNS configuration uses the following template:
da: I denne konfiguration skal du angive det *domæne*, som denne konfiguration aktiverer, og indholdet af `ddclient.conf`, der bruges af `ddclient`_. Der findes forskellige eksempler på `officiel dokumentation`_, den, der bruges til den guidede DNS-konfiguration, bruger følgende skabelon:

source: Once you actiavted this configuration, you can *Continue to TLS activation* - see below
da: Når du har aktiveret denne konfiguration, kan du *Fortsætte til TLS-aktivering* - se nedenfor

source: Enable TLS
da: Aktiver TLS

source: On this page first wait for the status-bars to settle and mainly ensure that *reachability* of your NextBox is tested successfully. If this is the case, just click **Enable TLS** to acquire your TLS certificate.
da: På denne side skal du først vente på, at statusbjælkerne sætter sig, og først og fremmest sikre dig, at *reachability* af din NextBox er testet med succes. Hvis dette er tilfældet, skal du blot klikke på **Enable TLS** for at erhverve dit TLS-certifikat.

source: If the reachibility test fails, make sure your :doc:`port forwarding <port-forwarding>` is configured properly.
da: Hvis test af tilgængelighed ikke lykkes, skal du sikre dig, at din :doc:`port forwarding <port-forwarding>` er konfigureret korrekt.

source: Managing Remote Access
da: Håndtering af fjernadgang

source: Your NextBox comes with different options on how to enable access to your NextBox from any remote location as long as you have an internet connection available.
da: Din NextBox leveres med forskellige muligheder for at få adgang til din NextBox fra et hvilket som helst fjerntliggende sted, så længe du har en internetforbindelse til rådighed.

source: If you struggle with the overall topic, please read:
da: Hvis du har svært ved at forstå det overordnede emne, kan du læse:

source: Even though the *Backwards Proxy* remote access method is a quick way to realize remote access, we **strongly recommend** to use a :doc:`dynamic DNS setup<dynamic-dns>` or :doc:`static DNS setup<static>` to maintain the best security level for your NextBox. *In most usage scenarios the latter will also provide a better data bandwidth and user experience*
da: Selvom *Backwards Proxy* fjernadgang er en hurtig måde at opnå fjernadgang på, anbefaler vi **stærk** at bruge en :doc:`dynamisk DNS opsætning<dynamic-dns>` eller :doc:`statisk DNS opsætning<static>` for at opretholde det bedste sikkerhedsniveau for din NextBox. *I de fleste brugsscenarier vil sidstnævnte også give en bedre databåndbredde og brugeroplevelse*

source: Before you set up a remote access method you might want to read the :doc:`comparison<method-comparison>` in order to understand the trade-offs and capabilities of the different approaches:
da: Før du konfigurerer en fjernadgangsmåde, bør du læse :doc:`comparison<method-comparison>` for at forstå de forskellige fremgangsmåders kompromiser og muligheder:

source: There are different ways to make your NextBox available for remote access.
da: Der er forskellige måder at gøre din NextBox tilgængelig for fjernadgang på.

source: The following topics might be of interest for you, depending on your internet service provider and the type of your internet connection:
da: Følgende emner kan være af interesse for dig, afhængigt af din internetudbyder og typen af din internetforbindelse:

source: IPv6-related Settings
da: IPv6-relaterede indstillinger

source: You have properly set up one of the DNS configurations, :doc:`port-forwarding` and :doc:`dns-rebind` and still your NextBox is not available / reachable.
da: Du har konfigureret en af DNS-konfigurationerne korrekt, :doc:`port-forwarding` og :doc:`dns-rebind`, og alligevel er din NextBox ikke tilgængelig/tilgængelig.

source: This is in particular important for Fritz!Box owners and/or DS-Lite internet connections.
da: Dette er især vigtigt for Fritz!Box-ejere og/eller DS-Lite-internetforbindelser.

source: First test your (sub-)domain using a 3rd party service like `IPv6 Test`_ to test your NextBox' IPv6 reachability. If this fails this is another indicator that your IPv6 settings are not correct.
da: Test først dit (sub-)domæne ved hjælp af en tredjepartstjeneste som `IPv6 Test`_ for at teste din NextBox' IPv6-henvendelighed. Hvis dette mislykkes, er det endnu en indikator for, at dine IPv6-indstillinger ikke er korrekte.

source: Some routers might have a bad default configuration for IPv6. Therefore please ensure that your router is configured to pass IPv6 addresses to your network clients (called ``IA_NA``), if this not done, no IPv6 connection can be established to your NextBox from the outside, thus your NextBox is not reachable.
da: Nogle routere kan have en dårlig standardkonfiguration for IPv6. Sørg derfor for at din router er konfigureret til at videregive IPv6-adresser til dine netværksklienter (kaldet ``IA_NA``), hvis dette ikke er gjort, kan der ikke etableres en IPv6-forbindelse til din NextBox udefra, og din NextBox kan derfor ikke nås.

source: On a recent *Fritz!Box* you will find this configuration inside: "Home Network -> "Network" -> "Network Settings" -> "IPv6 Configuration" Inside this view inside the section: "DHCPv6 Server in the Home Network" activate: "Enable DHCPv6 server in the FRITZ!Box for the home network:" and below this the last radio button has to be active: "Assign DNS server, prefix (IA_PD) and IPv6 address (IA_NA)" instead of the default, which is the 1st radio button.
da: På en nyere *Fritz!Box* finder du denne konfiguration inde i: "Hjemmenetværk -> "Netværk" -> "Netværksindstillinger" -> "IPv6-konfiguration" Inde i denne visning i afsnittet: "DHCPv6-server i hjemmenetværket" aktiver: "Aktivér DHCPv6-server i FRITZ!Box for the home network:" og under dette skal den sidste radioknap være aktiv: "Assign DNS server, prefix (IA_PD) and IPv6 address (IA_NA)" i stedet for standard, som er den første radioknap.

source: Comparing Methods For (Remote) Access
da: Sammenligning af metoder til (fjern)adgang

source: DNS-based
da: DNS-baseret

source: This is clearly the best and most secure approach and we recommend using a DNS-based remote-access method including your own TLS certificate for the best security
da: Dette er klart den bedste og mest sikre tilgang, og vi anbefaler at bruge en DNS-baseret fjernadgangsmåde med dit eget TLS-certifikat for at opnå den bedste sikkerhed.

source: This denotes the :doc:`dynamic-dns` and the :doc:`static` approach.
da: Dette betegner :doc:`dynamic-dns` og :doc:`static`.

source: Clearly the *best* method, but also the one requiring some configuration work on your internet router.
da: Det er helt klart den *bedste* metode, men også den, der kræver noget konfigurationsarbejde på din internetrouter.

source: You get your *own* (sub)domain and a TLS certificate, thus all your traffic will always be end-to-end encrypted and you maintain the highest level of security for your traffic.
da: Du får dit *egne* (under)domæne og et TLS-certifikat, så al din trafik vil altid være end-to-end-krypteret, og du opretholder det højeste sikkerhedsniveau for din trafik.

source: Opening the right ports on your internet router is necessary, see :doc:`here<port-forwarding>`
da: Det er nødvendigt at åbne de rigtige porte på din internetrouter, se :doc:`her<port-forwarding>`

source: Data path: [NextBox] ⟷ [Router] ⟷ [Client]
da: Datasti: [NextBox] ⟷ [Router] ⟷ [Klient] ⟷ [Klient]

source: **Pro:** best performance, highest security, full end-to-end encryption
da: **Pro:** bedste ydeevne, højeste sikkerhed, fuld end-to-end-kryptering

source: **Contra:** needs (dynamic) DNS, needs configuration on your internet router
da: **Contra:** har brug for (dynamisk) DNS, kræver konfiguration på din internetrouter

source: Non-encrypted
da: Ikke-krypteret

source: We strongly recommend to not use the non-encrypted setup, if you plan to make your NextBox available outside of your local area network.
da: Vi anbefaler på det kraftigste, at du ikke bruger den ikke-krypterede opsætning, hvis du planlægger at gøre din NextBox tilgængelig uden for dit lokale netværk.

source: simple (``http``) using either ``nextbox.local`` or your local IP (e.g.: ``192.168.178.123``)
da: simpel (``http``) ved hjælp af enten ``nextbox.local`` eller din lokale IP (f.eks.: ``192.168.178.123``)

source: Generally a bad idea, this will not encrypt the transported data in any way and is only useful in a setup where you do not want remote access to your NextBox (having non-encrypted traffic inside your LAN might be no problem, as long as you know what you are doing)
da: Generelt er det en dårlig idé, dette vil ikke kryptere de transporterede data på nogen måde og er kun nyttigt i en opsætning, hvor du ikke ønsker fjernadgang til din NextBox (ikke-krypteret trafik inden for dit LAN kan ikke være noget problem, så længe du ved, hvad du gør).

source: **Pro:** fast, no configuration
da: **Pro:** hurtigt, ingen konfiguration

source: **Contra:** no transport security, no remote access (or only unencrypted)
da: **Contra:** ingen transportsikkerhed, ingen fjernadgang (eller kun ukrypteret)

source: Further, once you set up TLS and thus a DNS-based method, the unencrypted connection for your NextBox will be disabled, this is not the case for the Reverse Proxy as a problem with the proxy would then lock you out of your NextBox.
da: Når du har oprettet TLS og dermed en DNS-baseret metode, vil den ukrypterede forbindelse til din NextBox blive deaktiveret, hvilket ikke er tilfældet for Reverse Proxy, da et problem med proxyen vil låse dig ude af din NextBox.

source: Nitrokey's Reverse Proxy
da: Nitrokey's omvendt fuldmagt

source: This refers to the :doc:`proxy` method.
da: Dette henviser til :doc:`proxy`-metoden.

source: Provides transport encryption between your clients and your NextBox. But with the drawback that it is not End-To-End encrypted, means the traffic will be decrypted at the Nitrokey Proxy Server and passed onward with another encryption. Thus a compromised proxy server might allow access to your traffic to the potential attacker.
da: Giver transportkryptering mellem dine klienter og din NextBox. Men med den ulempe, at den ikke er End-To-End krypteret, hvilket betyder, at trafikken vil blive dekrypteret på Nitrokey Proxy Server og sendt videre med en anden kryptering. Således kan en kompromitteret proxyserver give adgang til din trafik til den potentielle angriber.

source: The proxy server is a bottleneck and all traffic has to go through the proxy server, even if you are in a local network together with the NextBox the traffic has to go through the proxy server.
da: Proxyserveren er en flaskehals, og al trafik skal gå gennem proxyserveren, selv om du er i et lokalt netværk sammen med NextBox, skal trafikken gå gennem proxyserveren.

source: Data path (local client): [NextBox] ⟷ [Router]⟷ [Proxy Server] ⟷ [Router] ⟷ [Client]
da: Datasti (lokal klient): [NextBox] ⟷ [Router]⟷ [Proxyserver] ⟷ [Router] ⟷ [Router] ⟷ [Klient]

source: Data path (remote client): [NextBox] ⟷ [Router]⟷ [Proxy Server] ⟷ [Client]
da: Datasti (fjernklient): [NextBox] ⟷ [Router]⟷ [Proxyserver] ⟷ [Klient] ⟷ [Klient]

source: **Pro:** easy to setup, good transport security
da: **Pro:** let at opsætte, god transportsikkerhed

source: **Contra:** not strictly end-to-end encrypted, potentially slow (all traffic through the proxy)
da: **Contra:** ikke strengt end-to-end-krypteret, potentielt langsom (al trafik gennem proxy)

source: Non end-to-end encrypted does still mean all your traffic is indeed encrypted, but within the proxy server, in order to be forwarded the traffic will be decrypted once and encrypted again before being passed to the client or NextBox
da: Ikke end-to-end krypteret betyder stadig, at al din trafik er krypteret, men inden for proxyserveren vil trafikken blive dekrypteret én gang og krypteret igen for at blive videresendt, før den sendes til klienten eller NextBox.

source: Port Forwarding & Firewall Configuration
da: Portforwarding & konfiguration af firewall
