Repository: Nitrokey/nitrokey-doc
Catalog: locales/*/LC_MESSAGES/nextbox.po
Languages: da

source: You have your dynamic DNS correctly set up, but your NextBox is not reachable using the domain.
da: Du har konfigureret din dynamiske DNS korrekt, men din NextBox kan ikke nås via domænet.

source: Before looking into this topic, make sure your domain correctly resolves to your IP.
da: Før du undersøger dette emne, skal du sikre dig, at dit domæne er korrekt opløst til din IP-adresse.

source: For both IPv4 and IPv6 you need to properly configure your internet router to allow access to your NextBox. While most internet routers will refer to this configuration as *port forwarding*, in fact IPv4 based (dynamic) DNS will resolve to your router's IP. But IPv6 in contrast will resolve to a (globally) unique IP, which refers to your NextBox.
da: For både IPv4 og IPv6 skal du konfigurere din internetrouter korrekt for at give adgang til din NextBox. Mens de fleste internet-routere vil henvise til denne konfiguration som *port forwarding*, vil IPv4-baserede (dynamiske) DNS'er i virkeligheden opløse til din router's IP. Men IPv6 vil i modsætning hertil opløse til en (globalt) unik IP, som henviser til din NextBox.

source: Therefore in technical terms IPv4 needs port forwarding to be enabled and for IPv6 you need to open the firewall to allow access to your NextBox. But in reality most routers do not differentiate between those and just name it *port sharing* for either IPv4 or IPv6.
da: Teknisk set skal IPv4 derfor have port forwarding aktiveret, og for IPv6 skal du åbne firewallen for at give adgang til din NextBox. Men i virkeligheden skelner de fleste routere ikke mellem disse og kalder det bare *port sharing* for enten IPv4 eller IPv6.

source: **The port-forwarding and/or firewall rules have to be configured to allow traffic on ports 80 (HTTP-Server) and 443 (HTTPS-Server).**
da: **Portforwarding og/eller firewallregler skal konfigureres til at tillade trafik på port 80 (HTTP-server) og 443 (HTTPS-server).**

source: On a recent *Fritz!Box* you will find this configuration inside: "Internet -> Permit Access -> Port Sharing"
da: På en nyere *Fritz!Box* finder du denne konfiguration inde i: "Internet -> Permit Access -> Port Sharing"

source: Backwards Proxy Remote Access
da: Fjernadgang via bagudrettet proxy

source: **This is the fastest and easiest way to make your NextBox available for remote access.**
da: **Dette er den hurtigste og nemmeste måde at gøre din NextBox tilgængelig for fjernadgang.**

source: The only information to provide is the (sub)domain your NextBox should be available at. There is also no need for a port forwarding configuration or any other setting to be done at your internet router. Although this method is recommended, please be aware that this method also comes with some drawbacks:
da: De eneste oplysninger, du skal oplyse, er det (under)domæne, som din NextBox skal være tilgængelig på. Der er heller ikke behov for en port forwarding konfiguration eller andre indstillinger, der skal foretages på din internetrouter. Selv om denne metode anbefales, skal du være opmærksom på, at denne metode også har nogle ulemper:

source: All traffic is passed through our (backwards) proxy server, thus is not end-to-end encrypted. *In particular, if this server is compromised, your traffic might be readable.*
da: Al trafik sendes gennem vores (bagudrettede) proxyserver og er derfor ikke end-to-end-krypteret. *Hvis denne server er kompromitteret, kan din trafik være læsbar.*

source: The same reason also introduces a bandwith bottleneck, if you are connecting to your NextBox from within your local area network (LAN). As all traffic has to be send to our proxy server and from there to your NextBox, the available bandwidth is limited to roughly 50% of your upload or download bandwidth (whichever is smaller).
da: Af samme årsag opstår der også en flaskehals i båndbredden, hvis du opretter forbindelse til din NextBox fra dit lokale netværk (LAN). Da al trafik skal sendes til vores proxyserver og derfra til din NextBox, er den tilgængelige båndbredde begrænset til ca. 50% of din upload- eller download-båndbredde (alt efter hvad der er mindst).

source: In order to not be affected by these drawbacks you can set up a :doc:`dynamic DNS provider <dynamic-dns>` or a :doc:`static domain <static>`.
da: For ikke at blive påvirket af disse ulemper kan du oprette en :doc:`dynamisk DNS-provider <dynamic-dns>` eller et :doc:`statisk domæne <static>`.

source: IPv6 to IPv4 Translation
da: Oversættelse fra IPv6 til IPv4

source: If your NextBox is only available through IPv6 (e.g., DS-Lite internet connection) the backwards proxy might be the only way to access your NextBox using a non-IPv6 enabled device. As of today e.g., various mobile network providers do not support IPv6 yet.
da: Hvis din NextBox kun er tilgængelig via IPv6 (f.eks. DS-Lite internetforbindelse) kan bagud-proxy være den eneste måde at få adgang til din NextBox på med en enhed, der ikke er IPv6-aktiveret. Fra i dag understøtter f.eks. forskellige udbydere af mobilnetværk endnu ikke IPv6.

source: Static DNS Configuration
da: Statisk DNS-konfiguration

source: This configuration shall be used, if you configured DNS and thus a domain for your NextBox in e.g., your internet router.
da: Denne konfiguration skal bruges, hvis du har konfigureret DNS og dermed et domæne for din NextBox i f.eks. din internetrouter.

source: In order to use the configured domain with your NextBox and its Nextcloud instance you must provide the full domain here to trust this domain inside your Nextcloud instance.
da: For at kunne bruge det konfigurerede domæne med din NextBox og dens Nextcloud-instans skal du angive det fulde domæne her for at kunne stole på dette domæne i din Nextcloud-instans.

source: For instance inside a "Fritz!Box" this can be done by navigating to: "Internet -> Permit Access -> DynDNS" and configuring a dynamic DNS provider of your choice.
da: For eksempel i en "Fritz!Box" kan dette gøres ved at navigere til: "Internet -&> Tillad adgang -> DynDNS" og konfigurere en dynamisk DNS-udbyder efter eget valg.

source: Remote Access Walkthrough
da: Gennemgang af fjernadgang

source: This documentation aims to give you a thorough introduction into the Remote Access topic, including a decision helper **why to choose a particular method**. If you are familiar with this topic you might want to jump directly to :doc:`method-comparison`.
da: Denne dokumentation har til formål at give dig en grundig introduktion til emnet fjernadgang, herunder en beslutningshjælper **hvorfor du skal vælge en bestemt metode**. Hvis du er bekendt med dette emne, kan du måske springe direkte til :doc:`method-comparison`.

source: What? Why?
da: Hvad? Hvorfor?

source: You want to access your NextBox from everywhere, this means you want to access your NextBox from the internet through your internet router.
da: Du ønsker at få adgang til din NextBox fra alle steder, det betyder at du ønsker at få adgang til din NextBox fra internettet via din internetrouter.

source: On top of that you want to make sure that your data (traffic) is not readable by anyone else despite you. Nowadays this is accomplished by using `HTTPS`_, which is driven by `TLS`_.
da: Desuden skal du sikre dig, at dine data (trafik) ikke kan læses af andre end dig. I dag opnås dette ved at bruge `HTTPS`_, som er drevet af `TLS`_.

source: Right next to the URL (*nitrokey.com*) you see this small padlock, which translates to: This website provides an encrypted connection and all your traffic is not readable by anyone between your browser (client) and the Nitrokey server.
da: Lige ved siden af URL'en (*nitrokey.com*) ser du denne lille hængelås, som betyder: Dette websted tilbyder en krypteret forbindelse, og al din trafik kan ikke læses af nogen mellem din browser (klient) og Nitrokey-serveren.

source: Once your NextBox is set up properly and you see the dashboard the first time your URL bar in your browser might look like this:
da: Når din NextBox er sat korrekt op, og du ser instrumentbrættet første gang, kan din URL-linje i din browser se således ud:

source: In this case the local IP has been used (``192.168.10.50``), this is specific to your local network and equal to ``nextbox.local``. The *not secure* and the warning sign transports the information that your connection is **not encrypted**, thus using *http* instead of *https*. For more you can read: `HTTP vs. HTTPS`_.
da: I dette tilfælde er den lokale IP blevet anvendt (``192.168.10.50``), som er specifik for dit lokale netværk og er lig med ``nextbox.local``. *not secure* og advarselstegnet transporterer oplysninger om, at din forbindelse **ikke er krypteret**, og at du derfor bruger *http* i stedet for *https*. Du kan læse mere om det: `HTTP vs. HTTPS`_.

source: Obviously, access to the NextBox should be secure, thus encrypted using *https*. This guide covers the different approaches to reach this goal, depending on your specific needs.
da: Det er klart, at adgangen til NextBox skal være sikker, og derfor skal den krypteres ved hjælp af *https*. Denne vejledning dækker de forskellige tilgange til at nå dette mål, afhængigt af dine specifikke behov.

source: Use The Nitrokey Backwards Proxy
da: Brug Nitrokey Backwards Proxy

source: This method is by far the easiest to set up and use to get an encrypted to your NextBox from everywhere, the only think to do is to go to *Remote Access* and *Backwards Proxy* inside the NextBox-App, insert a sub-domain you want to use and click *Enable Quickstart Remote Access*. From now on you can access your NextBox using a URL like this:
da: Denne metode er langt den nemmeste at sætte op og bruge til at få en krypteret adgang til din NextBox fra alle steder, det eneste du skal gøre er at gå til *Remote Access* og *Backwards Proxy* inde i NextBox-App'en, indsæt et subdomæne du vil bruge og klik på *Enable Quickstart Remote Access*. Fra nu af kan du få adgang til din NextBox ved hjælp af en URL som denne:

source: The padlock is there---your data (if you are using your ``[subdomain].nextbox.link`` URL) is now encrypted!
da: Hængelåsen er der---dine data (hvis du bruger din ``[subdomain].nextbox.link`` URL) er nu krypteret!

source: So far so good, but wait, this works, but has two major drawbacks: Performance and a chained end-to-end encryption.
da: Så langt så godt, men vent, det virker, men har to store ulemper: Ydelsen og en kæde af end-to-end-kryptering.

source: Performance
da: Ydelse

source: The backwards proxy works like this: Your NextBox connects to the Nitrokey Proxy server and opens up a (backwards) channel. So even though your NextBox is maybe standing right next to your computer, the traffic goes all the way from your computer, into the internet, to the Nitrokey server and all the way back to your NextBox.
da: Den bagudrettede proxy fungerer på følgende måde: Din NextBox opretter forbindelse til Nitrokey Proxy-serveren og åbner en (bagudrettet) kanal. Så selv om din NextBox måske står lige ved siden af din computer, går trafikken hele vejen fra din computer, ind på internettet, til Nitrokey-serveren og hele vejen tilbage til din NextBox.

source: Simplified, one could say all the traffic has to travel a long way towards the NextBox instead of talking directly to the NextBox. This essentially is a drawback of all proxies. The effect for you as a user is that data transfers will be slower, than a direct connection.
da: Forenklet kan man sige, at al trafik skal rejse langt hen til NextBox i stedet for at tale direkte til NextBox. Dette er i det væsentlige en ulempe ved alle proxyer. Virkningen for dig som bruger er, at dataoverførsler vil være langsommere, end en direkte forbindelse.

source: Chained End-to-End Encryption
da: Kædet end-to-end-kryptering

source: Another drawback is that your traffic is not fully end-to-end encrypted. To be clear: Your data is still encrypted, but only on the path from your client (browser) to the Nitrokey server, there the data will be decrypted and encrypted again to be sent to the NextBox.
da: En anden ulempe er, at din trafik ikke er fuldstændig end-to-end-krypteret. For at være helt klar: Dine data er stadig krypteret, men kun på vejen fra din klient (browser) til Nitrokey-serveren, hvor dataene bliver dekrypteret og krypteret igen for at blive sendt til NextBox.

source: Essentially this means you have to trust Nitrokey, because technically whoever is controlling this server might read the traffic that goes through it using this proxy. Nitrokey would never do such a thing, but there is a certain remaining risk that someone could compromise this server and read your traffic.
da: Det betyder i bund og grund, at du er nødt til at stole på Nitrokey, for teknisk set kan den, der styrer denne server, læse den trafik, der går gennem den ved hjælp af denne proxy. Nitrokey ville aldrig gøre noget sådant, men der er en vis risiko for, at nogen kan kompromittere denne server og læse din trafik.

source: Obviously this can be done in a better way, but still this might be enough depending on your personal usage scenario.
da: Dette kan naturligvis gøres bedre, men det kan stadig være nok afhængigt af dit personlige brugsscenarie.

source: Acquire Your Own Certificate
da: Anskaf dit eget certifikat

source: This is clearly the best and most secure method to remote access your NextBox as it will give your the best performance and true end-to-end encryption, but it comes with some additional configuration needs. We start first with a very quick introduction what encryption with an own certificate means and what is needed.
da: Dette er helt klart den bedste og mest sikre metode til fjernadgang til din NextBox, da den giver dig den bedste ydeevne og ægte end-to-end-kryptering, men den kommer med nogle ekstra konfigurationsbehov. Vi starter først med en meget hurtig introduktion til, hvad kryptering med eget certifikat betyder, og hvad der er nødvendigt.

source: The Certificate Authority
da: Den certificeringsmyndighed

source: A `CA`_, as the name suggests, is *someone* who is able to provide you with a digital certificate, which will allow you to use `TLS`_, thus encrypt the your traffic, enabling you to use *https*.
da: En `CA`_ er, som navnet antyder, *en person*, der kan give dig et digitalt certifikat, som gør det muligt for dig at bruge `TLS`_, og dermed kryptere din trafik, så du kan bruge *https*.

source: By definition, a `CA`_ is only allowed to issue a certificate, if they can verify that your are the **owner of a public internet (sub)domain**. This ownership is a very important property as this, despite the encryption, additionally allows the client (browser) to verify that the traffic that is sent by a certain website is really originating from this (sub)domain and no man-in-the-middle has injected some data, which could compromise your client.
da: Pr. definition må en `CA`_ kun udstede et certifikat, hvis den kan bekræfte, at du er **indehaver af et offentligt internet(under)domæne**. Dette ejerskab er en meget vigtig egenskab, da det på trods af krypteringen desuden gør det muligt for klienten (browseren) at kontrollere, at den trafik, der sendes fra et bestemt websted, virkelig stammer fra dette (under)domæne, og at der ikke er nogen man-in-the-middle, der har indlagt nogle data, som kan kompromittere din klient.

source: This being said, obviously it is not possible to acquire an certificate for *nextbox.local* or even a local IP, as these are neither public nor unique.
da: Når det er sagt, er det naturligvis ikke muligt at erhverve et certifikat for *nextbox.local* eller endda en lokal IP, da disse hverken er offentlige eller unikke.

source: Acquire a public (sub)domain for your NextBox
da: Anskaf et offentligt (under)domæne til din NextBox

source: The NextBox comes with a feature (:doc:`dynamic-dns`), which allows you to easily register a public sub-domain for your NextBox using a so-called *dynamic DNS provider*, here namely `deSEC`_. This particular service is totally free and a non-profit organization.
da: NextBox leveres med en funktion (:doc:`dynamic-dns`), som giver dig mulighed for nemt at registrere et offentligt underdomæne til din NextBox ved hjælp af en såkaldt *dynamisk DNS-provider*, her nemlig `deSEC`_. Denne særlige tjeneste er helt gratis og en non-profit organisation.

source: This is a very important step prior to acquiring a certificate, as this sub-domain registered through `deSEC`_ will be public and unique, whose as we learned are needed to acquire a certificate.
da: Dette er et meget vigtigt skridt før erhvervelse af et certifikat, da dette subdomæne, der er registreret via `deSEC`_, vil være offentligt og unikt, hvilket som vi lærte er nødvendigt for at erhverve et certifikat.

source: Step-by-Step DNS & TLS
da: Trin-for-trin DNS & TLS

source: This may sound complex, but the NextBox comes with all you need to get through this process:
da: Det lyder måske kompliceret, men NextBox leveres med alt, hvad du behøver for at komme igennem denne proces:

source: Navigate to the Nextcloud NextBox-App
da: Naviger til Nextcloud NextBox-appen

source: Click on "Guided Dynamic DNS"
da: Klik på "Guidet dynamisk DNS"

source: Insert a valid e-mail address you have access to into the first input field
da: Indsæt en gyldig e-mailadresse, som du har adgang til, i det første indtastningsfelt

source: Insert the full sub-domain your NextBox shall be available through. As `deSEC`_ is used here, your sub-domain always has to end with *dedyn.io*, so something like: ``mynextbox.dedyn.io``
da: Indsæt det fulde subdomæne, som din NextBox skal være tilgængelig via. Da `deSEC`_ bruges her, skal dit subdomæne altid ende med *dedyn.io*, så noget i stil med: ``mynextbox.dedyn.io``

source: Click "Register at deSEC" and the NextBox will try to register your domain and e-mail at `deSEC`_. This may fail, if the sub-domain you chose is already taken, please choose another one in this case.
da: Klik på "Registrer hos deSEC" og NextBox vil forsøge at registrere dit domæne og din e-mail hos `deSEC`_. Dette kan mislykkes, hvis det valgte subdomæne allerede er optaget, vælg venligst et andet i så fald.

source: You will receive an e-mail in which you should verify that this is your e-mail by clicking on the provided link
da: Du vil modtage en e-mail, hvori du skal bekræfte, at det er din e-mailadresse ved at klikke på det angivne link

source: In step two, you will have to input a *token*, which you received after you clicked the verification link and completed the captcha.
da: I trin to skal du indtaste et *token*, som du har modtaget, efter at du har klikket på bekræftelseslinket og udfyldt captcha-koden.

source: Now you are the owner of your very own sub-domain. You can try and visit this subdomain now, but you will see that it will only (best case) end up on your internet router. This is because your router is your door to the internet and it has to be made aware that you want specific traffic to be forwarded to your NextBox. Please set up :doc:`port-forwarding` on your internet router now, once this is done, visiting your registered sub-domain in the browser will show you your NextBox' Nextcloud instance.
da: Nu er du ejer af dit helt eget subdomæne. Du kan nu prøve at besøge dette underdomæne, men du vil se, at det i bedste fald kun vil ende på din internetrouter. Dette skyldes, at din router er din dør til internettet, og den skal gøres opmærksom på, at du ønsker, at specifik trafik skal videresendes til din NextBox. Du bedes oprette :doc:`port-forwarding` på din internetrouter nu, når dette er gjort, vil et besøg på dit registrerede subdomæne i browseren vise dig din NextBox' Nextcloud instans.

source: Great from here there is just one step remaining:
da: Herfra er der kun ét skridt tilbage:

source: Click on "HTTPS / TLS"
da: Klik på "HTTPS / TLS"

source: Click the button "Enable TLS"
da: Klik på knappen "Aktiver TLS"

source: Please wait some moments to acquire your certificate
da: Vent venligst et øjeblik for at få dit certifikat

source: Shortly after you will be automatically redirected to your now encrypted NextBox sub-domain, which might look similar to this:
da: Kort efter vil du automatisk blive omdirigeret til dit nu krypterede NextBox sub-domæne, som kan se ud som dette:

source: There we are, your very own sub-domain, certificate and fully end-to-end encrypted Nextcloud.
da: Så er vi der, dit helt eget subdomæne, certifikat og fuldt end-to-end-krypteret Nextcloud.

source: If you encounter problems, please read the other articles inside the :doc:`Remote Access Section<index>`.
da: Hvis du støder på problemer, kan du læse de andre artikler i :doc:`Remote Access Section<index>`.

source: Factory Reset
da: Fabriksnulstilling

source: Factory Resetting your NextBox will inevitably **delete all your files** on the NextBox and any configuration settings.
da: Factory Resetting af din NextBox vil uundgåeligt **slette alle dine filer** på NextBoxen og alle konfigurationsindstillinger.

source: **To factory reset your NextBox simply press the hardware button for 5 seconds.**
da: **For at nulstille din NextBox fra fabrikken skal du blot trykke på hardwareknappen i 5 sekunder.**

source: The NextBox LED will change to *blue* once you press the button, after the 5 seconds have passed the color will change to blinking red (see :doc:`LED documentation <led-colors>`). Once the LED has finally reached *green* again your NextBox is ready for the initial setup as described in :doc:`Getting Started <../gettingstarted>`
da: NextBox-lysdioden skifter til *blå*, når du trykker på knappen, og efter de 5 sekunder, der er gået, skifter farven til blinkende rød (se :doc:`LED-dokumentation <led-colors>`). Når LED'en endelig er blevet *grøn* igen, er din NextBox klar til den indledende opsætning som beskrevet i :doc:`Geting Started <../gettingstarted>`

source: The hardware button is a pinhole-style button similar to other embedded devices. In order to press it, it is recommended to use a thin (~1mm) needle-like pin. E.g., the pin to remove a sim-card from a smartphone is working great. **Further take care to not press the button too hard, be careful, there should be a recognizable haptic feedback (button click) with minimal applied force.**
da: Hardwareknappen er en knap i pinhole-stil, der ligner andre indlejrede enheder. For at trykke på den anbefales det at bruge en tynd (~1 mm) nåleagtig nål til at trykke på den. F.eks. fungerer nålen til at fjerne et sim-kort fra en smartphone glimrende. **Der skal endvidere sørges for ikke at trykke for hårdt på knappen, vær forsigtig, der skal være en genkendelig haptisk feedback (knapklik) med minimal anvendt kraft.**

source: Technical Documentation
da: Teknisk dokumentation

source: LED Colors and Patterns
da: LED-farver og -mønstre

source: Color
da: Farve

source: Pattern
da: Mønster

source: Description
da: Beskrivelse

source: Dimmed-out-Blue
da: Udblændet blå

source: None
da: Ingen

source: NextBox is booting
da: NextBox er ved at starte op

source: Green
da: Grøn

source: NextBox Daemon active and in regular operating mode
da: NextBox Daemon er aktiv og i normal driftstilstand

source: Fast-Blink
da: Hurtigkobling

source: Nextcloud is starting up (docker starting)
da: Nextcloud starter op (docker starter)

source: Blue
da: Blå

source: (Reset) button is currently being pressed
da: (Nulstil) knappen er trykket på i øjeblikket

source: Yellow
da: Gul

source: Initializing NextBox Daemon
da: Initialisering af NextBox-dæmonen

source: NextBox Daemon update check/apply
da: NextBox Daemon opdateringskontrol/anvendelse

source: Red
da: Rød

source: Factory-Reset is ongoing
da: Factory-Reset er i gang

source: Purple
da: Lilla

source: Nextcloud Maintenance mode active
da: Nextcloud Vedligeholdelsestilstand aktiv
