Repository: Nitrokey/nitrokey-doc
Catalog: locales/*/LC_MESSAGES/nextbox.po
Languages: da

source: **Fast-Blink** means 0,5secs on and 0,5secs off
da: **Fast-Blink** betyder 0,5 sek. tændt og 0,5 sek. slukket

source: **Blink** means 2secs on and 2secs off
da: **Blink** betyder 2 sek. tændt og 2 sek. slukket

source: If the LED is *purple*, the Nextcloud instance is in maintenance mode, you can force exit the maintenance mode by pushing the hardware button **shortly, once**. The NextBox will then switch-off the maintenance mode.
da: Hvis lysdioden er *lilla*, er Nextcloud-instansen i vedligeholdelsestilstand, og du kan tvinge den til at forlade vedligeholdelsestilstanden ved at trykke på hardwareknappen **kortvarigt, én gang**. NextBoxen vil derefter slukke for vedligeholdelsestilstanden.

source: As of today if the maintenance mode is switched using the button press, the "mail" app will in addition be disabled as the version 1.11.0 together with Nextcloud version 21.0.0.x will never exit the maintenance mode.
da: Fra og med i dag, hvis vedligeholdelsestilstanden skiftes ved hjælp af et tryk på knappen, vil "mail" appen desuden blive deaktiveret, da version 1.11.0 sammen med Nextcloud version 21.0.0.0.x aldrig vil forlade vedligeholdelsestilstanden.

source: Replace Internal Hard-Drive
da: Udskift intern harddisk

source: Please do this only, if you know what you are doing. By modifying the NextBox you void your warranty for at least the hardware of the NextBox. These steps are generally not covered by the support, you are modifying your NextBox at your own risk!
da: Du må kun gøre dette, hvis du ved, hvad du gør. Ved at ændre NextBoxen annullerer du din garanti for i det mindste NextBoxens hardware. Disse trin er generelt ikke dækket af support, du ændrer din NextBox på egen risiko!

source: Prerequisites
da: Forudsætninger

source: Linux(-like) operating system
da: Linux(-lignende) styresystem

source: 2.5'' hard-drive with a max height of 15mm, most are 7mm
da: 2.5'' harddisk med en maks. højde på 15 mm, de fleste er 7 mm

source: A user which can acquire root-rights using ``sudo``
da: En bruger, der kan få root-rettigheder ved hjælp af ``sudo``

source: The following commands must be available: ``sudo``, ``parted``, ``mkfs.ext4``, ``bash``
da: Følgende kommandoer skal være tilgængelige: ``sudo``, ``parted``, ``mkfs.ext4``, ``bash``, ``bash``.

source: At least a basic understanding about mounting / unmounting and shell-scripts (execution)
da: Mindst en grundlæggende forståelse for montering/afmontering og shell-scripts (udførelse)

source: Phillips Screwdriver
da: Phillips skruetrækker

source: Set up the ssh-access on your NextBox
da: Opsæt ssh-adgang på din NextBox

source: The script which is used will acquire root rights to wipe the hard-drive you pass to the script. **Be extremely careful to pass the correct device to the script, if you pass your system partition, this script will destroy your runnning OS!** Any data on the passed hard-drive will inevitably be deleted!
da: Scriptet, der bruges, får root-rettigheder til at slette den harddisk, du sender til scriptet. ** Vær ekstremt forsigtig med at give den korrekte enhed til scriptet, hvis du giver din systempartition, vil scriptet ødelægge dit kørende operativsystem!** Alle data på den overgivne harddisk vil uundgåeligt blive slettet!

source: Read the following steps completely and thoroughly **before executing them**, if you do not understand what a certain step means this might be an indication that you should not do this by yourself.
da: Læs de følgende trin helt og grundigt **før du udfører dem**, hvis du ikke forstår, hvad et bestemt trin betyder, kan det være et tegn på, at du ikke bør gøre det selv.

source: Prepare New Hard-Disk
da: Forbered ny harddisk

source: Get your ``nextbox.conf`` file from your original hard-disk using ssh, it is located on your NextBox inside the ``/srv/nextbox`` directory
da: Hent din ``nextbox.conf`` fil fra din originale harddisk ved hjælp af ssh, den er placeret på din NextBox i mappen ``/srv/nextbox``.

source: Save your ``nextbox.conf`` on your computer
da: Gem din ``nextbox.conf`` på din computer

source: Get the following script: https://raw.githubusercontent.com/Nitrokey/nextbox/master/simple_prepare_harddrive.sh
da: Hent følgende script: https://raw.githubusercontent.com/Nitrokey/nextbox/master/simple_prepare_harddrive.sh

source: Make the script executable: ``chmod +x simple_prepare_harddrive.sh``
da: Gør scriptet eksekverbart: ``chmod +x simple_prepare_harddrive.sh``

source: Connect your new hard-disk to your computer
da: Tilslut din nye harddisk til din computer

source: Determine your hard-disk's device name (e.g., ``/dev/sdb``) and make sure none of its partitions are mounted
da: Bestem din harddisk's enhedsnavn (f.eks. ``/dev/sdb``) og sørg for, at ingen af dens partitioner er monteret

source: **Again: think at least twice about the following step. Make sure you are referring to the correct hard-drive device (and NOT a partition, means** ``/dev/sdb1`` **is wrong).** The script will decline to do the operation on ``/dev/sda`` as there are good chances this might be your system hard-disk, if you really need this you can comment out lines 23-26 inside the script.
da: **Igen: Tænk mindst to gange over det følgende trin. Sørg for, at du henviser til den korrekte harddisk-enhed (og IKKE til en partition, hvilket betyder** ``/dev/sdb1`` **er forkert).**Scriptet vil afvise at udføre operationen på ``/dev/sda``, da der er gode chancer for, at dette kan være din systemharddisk, hvis du virkelig har brug for dette, kan du kommentere linjerne 23-26 ud inde i scriptet.

source: Run the script using the device name you have determined. Once prompted for your sudo-password please provide it to allow r/w access to the hard-drive:
da: Kør scriptet med det enhedsnavn, du har bestemt. Når du bliver bedt om dit sudo-password, skal du angive det for at give r/w-adgang til harddisken:

source: Watch the script's output for any errors, there should be none
da: Se scriptet's output for eventuelle fejl, der bør ikke være nogen.

source: At the end of the script you will be asked to mount the created partition and copy over the ``nextbox.conf`` (to ``/nextbox``) you copied in step 1. and 2., unmount the partition and you have successfully prepared your new hard-drive.
da: I slutningen af scriptet vil du blive bedt om at montere den oprettede partition og kopiere den ``nextbox.conf`` (til ``/nextbox``) du kopierede i trin 1. og 2., afmontere partitionen og du har forberedt din nye harddisk med succes.

source: Replacement Guide
da: Udskiftningsvejledning

source: Inside the NextBox Nextcloud App go to "System Settings" and switch it off your NextBox using the "Poweroff" button
da: Gå til "Systemindstillinger" i NextBox Nextcloud App og sluk for din NextBox ved hjælp af "Poweroff" knappen

source: Once the Status LED is shortly off (not entirely, thus very dark) and the Ethernet port LEDs are off you can unplug all cables from your NextBox
da: Når status LED'en er slukket (ikke helt, men meget mørk) og Ethernet port LED'erne er slukket, kan du tage alle kabler ud af NextBoxen.

source: Unscrew all 8 Phillips screws
da: Skru alle 8 Phillips-skruer ud

source: Carefully remove the top-cover (as vertical as possible) first
da: Fjern forsigtigt først topdækslet (så lodret som muligt)

source: Again carefully, vertically remove the bottom cover, now you see the so-called bridge
da: Igen forsigtigt, fjern det nederste dæksel lodret, nu ser du den såkaldte bro.

source: Unfold the USB-to-SATA cable and put the NextBox bridge upside down onto a electronics friendly surface like a desk as shown in the following image
da: Fold USB-til-SATA-kablet ud, og sæt NextBox bridge på hovedet på en elektronikvenlig overflade som f.eks. et skrivebord som vist på følgende billede

source: Unscrew the Phillips screws holding the hard-disk in position (the amount of screws may differ, depending on your hard-disk type) shown in the following image:
da: Skru Phillips-skruerne, der holder harddisken på plads, ud (antallet af skruer kan variere afhængigt af harddisktypen), som vist på følgende billede:

source: Once the screws are removed, push the hard-disk carefully towards the direction shown in the image above. Do not push it towards the other direction, you might damage the USB cable.
da: Når skruerne er fjernet, skal du skubbe harddisken forsigtigt i den retning, der er vist på billedet ovenfor. Du må ikke skubbe den i den anden retning, da du ellers kan beskadige USB-kablet.

source: Remove the USB-to-SATA cable from the hard-drive
da: Fjern USB-til-SATA-kablet fra harddisken

source: Avoid disconnecting the male-female USB connector to not change the position and bending of the cable. If you have to: be careful to keep the force as small as possible onto the 90° part of the USB extension cable.
da: Undgå at afbryde USB-stikket med han-hun-stik for ikke at ændre kablets position og bøjning. Hvis du er nødt til det: Vær forsigtig med at holde kraften så lille som muligt på 90°-delen af USB-forlængerkablet.

source: Connect your previously prepared new hard-drive
da: Tilslut din tidligere forberedte nye harddisk

source: Carefully slide your new hard-drive into the bridge and fix it into the right position using the previously removed screws
da: Skub forsigtigt din nye harddisk ind i broen, og fastgør den i den rigtige position med de tidligere fjernede skruer

source: Fold the USB-to-SATA cable (in circles) into the open space behind the hard-disk.
da: Fold USB-til-SATA-kablet (i cirkler) ind i det åbne rum bag harddisken.

source: Finally assemble your NextBox again in reverse order using steps 5. to 3.
da: Til sidst samler du din NextBox igen i omvendt rækkefølge ved hjælp af trin 5. til 3.

source: On first boot after the assembly, give the NextBox enough time to boot and get all necessary packages from the internet. **Make sure you have ethernet connected**. You should expect a changing status LED (yellow shall be first) quite fast (less than 2 minutes). If the status LED does not change at all, it is likely that there is something wrong with your hard-drive wiring or contents.
da: Ved første opstart efter samling skal du give NextBox tid nok til at starte op og hente alle nødvendige pakker fra internettet. **Sørg for, at du har ethernet tilsluttet**. Du skal forvente en skiftende status-LED (gul skal være først) ret hurtigt (mindre end 2 minutter). Hvis status-LED'en ikke ændrer sig overhovedet, er der sandsynligvis noget galt med din harddisk ledningsføring eller indholdet.

source: Troubleshooting
da: Fejlfinding
